// Source
// npx tsx app/conversion.tsx 

var 料理 = [
    { "名称": "黑暗物质", "厨具": "任意", "价格/円": "1", "食材": "任意", "正特性": "黑暗物质", "反特性": "", "时间（1级）": "任意", "时间（50级）": "任意", "等级": "1", "获取方式": "料理制作失败" },
    { "名称": "饭团", "厨具": "料理台", "价格/円": "6", "食材": "海苔", "正特性": "实惠、家常、素、饱腹、和风", "反特性": "", "时间（1级）": "5", "时间（50级）": "3", "等级": "1", "获取方式": "升级" },
    { "名称": "海鲜味噌汤", "厨具": "煮锅", "价格/円": "8", "食材": "海苔", "正特性": "实惠、家常、素、汤羹", "反特性": "重油", "时间（1级）": "6", "时间（50级）": "3.6", "等级": "1", "获取方式": "初始拥有" },
    { "名称": "司康饼", "厨具": "蒸锅", "价格/円": "8", "食材": "黄油、面粉", "正特性": "实惠、饱腹、西式", "反特性": "", "时间（1级）": "7", "时间（50级）": "4.2", "等级": "1", "获取方式": "升级" },
    { "名称": "炙猪肉饭团", "厨具": "料理台", "价格/円": "14", "食材": "猪肉", "正特性": "实惠、家常、肉、饱腹、和风", "反特性": "", "时间（1级）": "6", "时间（50级）": "3.6", "等级": "2", "获取方式": "人间之里支线" },
    { "名称": "炒肉丝", "厨具": "油锅", "价格/円": "15", "食材": "猪肉", "正特性": "实惠、家常、肉、下酒、重油、中华", "反特性": "", "时间（1级）": "8", "时间（50级）": "4.8", "等级": "1", "获取方式": "博丽神社支线" },
    { "名称": "油豆腐", "厨具": "油锅", "价格/円": "16", "食材": "豆腐", "正特性": "实惠、家常、素、重油、和风", "反特性": "", "时间（1级）": "7", "时间（50级）": "4.2", "等级": "1", "获取方式": "上白泽慧音Lv1→Lv2" },
    { "名称": "露水煮蛋", "厨具": "蒸锅", "价格/円": "18", "食材": "鸡蛋、露水", "正特性": "实惠、清淡、生", "反特性": "肉、水产、重油", "时间（1级）": "3", "时间（50级）": "1.8", "等级": "2", "获取方式": "莉格露Lv1→Lv2" },
    { "名称": "烤蘑菇", "厨具": "烤架", "价格/円": "18", "食材": "蘑菇", "正特性": "实惠、素、咸、灼热、菌类、烧烤", "反特性": "", "时间（1级）": "6", "时间（50级）": "3.6", "等级": "1", "获取方式": "妖怪兽道支线" },
    { "名称": "豆腐锅", "厨具": "煮锅", "价格/円": "19", "食材": "豆腐", "正特性": "实惠、素、清淡、灼热、和风", "反特性": "", "时间（1级）": "5", "时间（50级）": "3", "等级": "1", "获取方式": "茨木华扇Lv1→Lv2" },
    { "名称": "香炸蝉蜕", "厨具": "油锅", "价格/円": "19", "食材": "蝉蜕", "正特性": "实惠、重油、猎奇", "反特性": "", "时间（1级）": "8", "时间（50级）": "4.8", "等级": "1", "获取方式": "莉格露Lv2→Lv3" },
    { "名称": "猪肉盖浇饭", "厨具": "煮锅", "价格/円": "20", "食材": "猪肉", "正特性": "家常、肉、饱腹", "反特性": "", "时间（1级）": "7", "时间（50级）": "4.2", "等级": "2", "获取方式": "升级" },
    { "名称": "牛肉盖浇饭", "厨具": "煮锅", "价格/円": "20", "食材": "牛肉", "正特性": "家常、肉、饱腹", "反特性": "", "时间（1级）": "7", "时间（50级）": "4.2", "等级": "2", "获取方式": "茨木华扇Lv2→Lv3" },
    { "名称": "奶油炖菜", "厨具": "蒸锅", "价格/円": "20", "食材": "洋葱、蘑菇、黄油", "正特性": "素、菌类、汤羹、西式", "反特性": "", "时间（1级）": "9", "时间（50级）": "5.4", "等级": "2", "获取方式": "升级" },
    { "名称": "月饼", "厨具": "蒸锅", "价格/円": "20", "食材": "蜂蜜、面粉、糯米、月光草", "正特性": "饱腹、小巧、甜、不可思议、文化底蕴、中华", "反特性": "", "时间（1级）": "10", "时间（50级）": "6", "等级": "5", "获取方式": "－" },
    { "名称": "凉菜雕花", "厨具": "料理台", "价格/円": "20", "食材": "萝卜", "正特性": "素、清淡、凉爽、适合拍照", "反特性": "肉、灼热", "时间（1级）": "5", "时间（50级）": "3", "等级": "1", "获取方式": "比那名居天子Lv1→Lv2" },
    { "名称": "豆腐味噌", "厨具": "煮锅", "价格/円": "21", "食材": "豆腐", "正特性": "家常、素、清淡、汤羹、和风", "反特性": "重油", "时间（1级）": "7", "时间（50级）": "4.2", "等级": "2", "获取方式": "稗田阿求Lv1→Lv2" },
    { "名称": "冷豆腐", "厨具": "料理台", "价格/円": "21", "食材": "豆腐、萝卜", "正特性": "家常、素、下酒、清淡、小巧", "反特性": "", "时间（1级）": "5", "时间（50级）": "3", "等级": "2", "获取方式": "初始拥有" },
    { "名称": "煮豆腐", "厨具": "煮锅", "价格/円": "22", "食材": "豆腐", "正特性": "家常、素、清淡", "反特性": "", "时间（1级）": "7", "时间（50级）": "4.2", "等级": "1", "获取方式": "升级" },
    { "名称": "土豆可乐饼", "厨具": "油锅", "价格/円": "22", "食材": "土豆", "正特性": "家常、素、重油", "反特性": "凉爽", "时间（1级）": "6", "时间（50级）": "3.6", "等级": "1", "获取方式": "升级" },
    { "名称": "热松饼", "厨具": "油锅", "价格/円": "22", "食材": "鸡蛋、蜂蜜、面粉", "正特性": "饱腹、甜、西式", "反特性": "", "时间（1级）": "9", "时间（50级）": "5.4", "等级": "2", "获取方式": "升级" },
    { "名称": "烤八目鳗", "厨具": "烤架", "价格/円": "22", "食材": "八目鳗", "正特性": "招牌、水产、烧烤", "反特性": "肉、素", "时间（1级）": "7", "时间（50级）": "4.2", "等级": "2", "获取方式": "初始拥有" },
    { "名称": "臭豆腐", "厨具": "油锅", "价格/円": "24", "食材": "豆腐、辣椒", "正特性": "素、辣、猎奇、中华", "反特性": "甜、果味", "时间（1级）": "5", "时间（50级）": "3", "等级": "1", "获取方式": "露米娅Lv1→Lv2" },
    { "名称": "炸猪肉排", "厨具": "油锅", "价格/円": "25", "食材": "猪肉", "正特性": "家常、肉、饱腹、重油", "反特性": "", "时间（1级）": "7", "时间（50级）": "4.2", "等级": "2", "获取方式": "伊吹萃香Lv1→Lv2" },
    { "名称": "竹笋炒肉", "厨具": "油锅", "价格/円": "25", "食材": "猪肉、竹笋", "正特性": "家常、肉、下酒", "反特性": "", "时间（1级）": "10", "时间（50级）": "6", "等级": "2", "获取方式": "升级" },
    { "名称": "北极甜虾蜜桃色拉", "厨具": "料理台", "价格/円": "25", "食材": "虾、桃子、冰块", "正特性": "素、水产、清淡、甜、果味、不可思议、适合拍照", "反特性": "肉、咸", "时间（1级）": "10", "时间（50级）": "6", "等级": "2", "获取方式": "比那名居天子Lv3→Lv4" },
    { "名称": "猪肉鳟鱼熏", "厨具": "烤架", "价格/円": "26", "食材": "鳟鱼、猪肉", "正特性": "家常、肉、水产、烧烤", "反特性": "", "时间（1级）": "7", "时间（50级）": "4.2", "等级": "2", "获取方式": "橙Lv2→Lv3" },
    { "名称": "炸八目鳗", "厨具": "油锅", "价格/円": "27", "食材": "八目鳗", "正特性": "招牌、水产、重油", "反特性": "凉爽", "时间（1级）": "7", "时间（50级）": "4.2", "等级": "2", "获取方式": "露米娅Lv2→Lv3" },
    { "名称": "麻薯", "厨具": "料理台", "价格/円": "30", "食材": "糯米", "正特性": "小巧、甜、和风", "反特性": "肉、水产、咸、鲜", "时间（1级）": "7", "时间（50级）": "4.2", "等级": "2", "获取方式": "因幡帝Lv1→Lv2" },
    { "名称": "温暖饭团", "厨具": "料理台", "价格/円": "30", "食材": "鳟鱼、洋葱", "正特性": "家常、素、水产、饱腹、灼热、和风", "反特性": "", "时间（1级）": "8", "时间（50级）": "4.8", "等级": "3", "获取方式": "博丽灵梦Lv1→Lv2" },
    { "名称": "秘制小鱼干", "厨具": "料理台", "价格/円": "30", "食材": "鳟鱼", "正特性": "水产、小巧、咸、鲜", "反特性": "", "时间（1级）": "8", "时间（50级）": "4.8", "等级": "2", "获取方式": "橙Lv1→Lv2" },
    { "名称": "麻婆豆腐", "厨具": "油锅", "价格/円": "32", "食材": "猪肉、豆腐、辣椒", "正特性": "素、辣、灼热、中华", "反特性": "甜、果味、凉爽", "时间（1级）": "6", "时间（50级）": "3.6", "等级": "2", "获取方式": "藤原妹红Lv1→Lv2" },
    { "名称": "力量汤", "厨具": "煮锅", "价格/円": "34", "食材": "野猪肉、海苔", "正特性": "肉、山珍、灼热、力量涌现、汤羹", "反特性": "小巧、凉爽", "时间（1级）": "12", "时间（50级）": "7.2", "等级": "3", "获取方式": "橙Lv3→Lv4" },
    { "名称": "汤圆", "厨具": "煮锅", "价格/円": "35", "食材": "糯米", "正特性": "家常、素、文化底蕴、中华", "反特性": "", "时间（1级）": "5", "时间（50级）": "3", "等级": "2", "获取方式": "香霖堂兑换（银色的青蛙硬币*5）" },
    { "名称": "水饺", "厨具": "煮锅", "价格/円": "35", "食材": "面粉", "正特性": "家常、素、文化底蕴、中华", "反特性": "", "时间（1级）": "5", "时间（50级）": "3", "等级": "2", "获取方式": "香霖堂兑换（银色的青蛙硬币*5）" },
    { "名称": "班尼迪克蛋", "厨具": "油锅", "价格/円": "35", "食材": "竹笋、鸡蛋、黄油、面粉", "正特性": "饱腹、小巧、生、西式", "反特性": "甜、果味", "时间（1级）": "7", "时间（50级）": "4.2", "等级": "2", "获取方式": "帕秋莉Lv1→Lv2" },
    { "名称": "杂炊", "厨具": "煮锅", "价格/円": "40", "食材": "鳟鱼、豆腐、海苔", "正特性": "家常、肉、鲜、灼热", "反特性": "", "时间（1级）": "5", "时间（50级）": "3", "等级": "2", "获取方式": "博丽灵梦Lv2→Lv3" },
    { "名称": "竹筒蒸蛋", "厨具": "蒸锅", "价格/円": "40", "食材": "海苔、蘑菇、鸡蛋、竹子", "正特性": "家常、清淡、菌类", "反特性": "", "时间（1级）": "6", "时间（50级）": "3.6", "等级": "2", "获取方式": "蓬莱山辉夜Lv1→Lv2" },
    { "名称": "流水素面", "厨具": "料理台", "价格/円": "40", "食材": "面粉、竹子", "正特性": "素、清淡、凉爽、不可思议", "反特性": "重油", "时间（1级）": "7", "时间（50级）": "4.2", "等级": "3", "获取方式": "迷途竹林支线" },
    { "名称": "红烧鳗鱼", "厨具": "油锅", "价格/円": "42", "食材": "八目鳗、洋葱", "正特性": "招牌、素、水产、重油、鲜", "反特性": "", "时间（1级）": "8", "时间（50级）": "4.8", "等级": "3", "获取方式": "红美铃Lv1→Lv2" },
    { "名称": "樱落雪", "厨具": "料理台", "价格/円": "50", "食材": "极上金枪鱼", "正特性": "水产、小巧、高级、生、海味、适合拍照、和风", "反特性": "重油", "时间（1级）": "12", "时间（50级）": "7.2", "等级": "4", "获取方式": "稗田阿求Lv3→Lv4" },
    { "名称": "能量串", "厨具": "烤架", "价格/円": "50", "食材": "牛肉、洋葱、南瓜", "正特性": "肉、饱腹、烧烤", "反特性": "", "时间（1级）": "12", "时间（50级）": "7.2", "等级": "3", "获取方式": "伊吹萃香Lv2→Lv3" },
    { "名称": "桃花羹", "厨具": "煮锅", "价格/円": "55", "食材": "桃子、露水、冰块", "正特性": "素、甜、果味、凉爽、适合拍照、汤羹", "反特性": "", "时间（1级）": "7", "时间（50级）": "4.2", "等级": "2", "获取方式": "比那名居天子Lv2→Lv3" },
    { "名称": "真·海鲜味噌汤", "厨具": "煮锅", "价格/円": "55", "食材": "鳟鱼、三文鱼", "正特性": "家常、水产、清淡、汤羹", "反特性": "", "时间（1级）": "8", "时间（50级）": "4.8", "等级": "2", "获取方式": "琪露诺Lv1→Lv2" },
    { "名称": "白桃生八桥", "厨具": "料理台", "价格/円": "55", "食材": "桃子、糯米", "正特性": "甜、果味、和风", "反特性": "肉、水产、咸、鲜", "时间（1级）": "5", "时间（50级）": "3", "等级": "2", "获取方式": "因幡帝Lv2→Lv3" },
    { "名称": "蔬菜专辑", "厨具": "料理台", "价格/円": "56", "食材": "土豆、洋葱、南瓜", "正特性": "素、清淡、生、凉爽", "反特性": "肉、水产、灼热", "时间（1级）": "5", "时间（50级）": "3", "等级": "3", "获取方式": "稗田阿求Lv2→Lv3" },
    { "名称": "香煎三文鱼", "厨具": "油锅", "价格/円": "58", "食材": "三文鱼、竹笋", "正特性": "肉、鲜、西式", "反特性": "", "时间（1级）": "10", "时间（50级）": "6", "等级": "3", "获取方式": "升级" },
    { "名称": "豚骨拉面", "厨具": "煮锅", "价格/円": "60", "食材": "猪肉、海苔、鸡蛋", "正特性": "家常、肉、饱腹、咸", "反特性": "", "时间（1级）": "8", "时间（50级）": "4.8", "等级": "3", "获取方式": "升级" },
    { "名称": "诗礼银杏", "厨具": "蒸锅", "价格/円": "60", "食材": "白果、蜂蜜", "正特性": "素、甜、文化底蕴、中华", "反特性": "咸", "时间（1级）": "8", "时间（50级）": "4.8", "等级": "3", "获取方式": "上白泽慧音Lv2→Lv3" },
    { "名称": "黄油牛排", "厨具": "油锅", "价格/円": "60", "食材": "和牛、黄油", "正特性": "肉、饱腹、重油、西式", "反特性": "甜、凉爽", "时间（1级）": "7", "时间（50级）": "4.2", "等级": "2", "获取方式": "红魔馆主线" },
    { "名称": "猩红恶魔蛋糕", "厨具": "料理台", "价格/円": "60", "食材": "土豆、南瓜、蜂蜜、露水", "正特性": "甜、梦幻、猎奇、适合拍照、西式", "反特性": "", "时间（1级）": "8", "时间（50级）": "4.8", "等级": "3", "获取方式": "妖怪兽道三妖精处购买" },
    { "名称": "无意识妖怪慕斯", "厨具": "料理台", "价格/円": "60", "食材": "豆腐、洋葱、蜂蜜、黄油", "正特性": "高级、甜、梦幻、适合拍照、西式", "反特性": "", "时间（1级）": "8", "时间（50级）": "4.8", "等级": "3", "获取方式": "妖怪兽道三妖精处购买" },
    { "名称": "白果萝卜排骨汤", "厨具": "煮锅", "价格/円": "65", "食材": "猪肉、萝卜、白果", "正特性": "昂贵、肉、灼热、汤羹、中华", "反特性": "", "时间（1级）": "6", "时间（50级）": "3.6", "等级": "2", "获取方式": "红美铃Lv2→Lv3" },
    { "名称": "竹取姬", "厨具": "蒸锅", "价格/円": "65", "食材": "黑毛猪肉、松露、竹笋、白果、竹子", "正特性": "昂贵、肉、高级、传说、适合拍照、文化底蕴、特产、和风", "反特性": "", "时间（1级）": "12", "时间（50级）": "7.2", "等级": "4", "获取方式": "竹林主线，藤原妹红" },
    { "名称": "不死鸟", "厨具": "烤架", "价格/円": "65", "食材": "土豆、洋葱、萝卜、蜂蜜、面粉", "正特性": "昂贵、高级、传说、燃起来了、适合拍照、烧烤、西式", "反特性": "", "时间（1级）": "12", "时间（50级）": "7.2", "等级": "4", "获取方式": "竹林主线，蓬莱山辉夜" },
    { "名称": "野味加农", "厨具": "煮锅", "价格/円": "66", "食材": "黑毛猪肉、土豆、南瓜", "正特性": "昂贵、肉、饱腹、重油、山珍、灼热", "反特性": "", "时间（1级）": "8", "时间（50级）": "4.8", "等级": "4", "获取方式": "茨木华扇Lv3→Lv4" },
    { "名称": "月之恋人", "厨具": "料理台", "价格/円": "66", "食材": "鸡蛋、黄油、面粉、月光草", "正特性": "昂贵、小巧、甜、适合拍照、特产", "反特性": "肉、素、水产", "时间（1级）": "10", "时间（50级）": "6", "等级": "3", "获取方式": "蓬莱山辉夜Lv2→Lv3" },
    { "名称": "水煮鱼", "厨具": "煮锅", "价格/円": "68", "食材": "鳟鱼、辣椒", "正特性": "昂贵、水产、辣、灼热、燃起来了、中华", "反特性": "肉、甜、果味、凉爽", "时间（1级）": "8", "时间（50级）": "4.8", "等级": "3", "获取方式": "藤原妹红Lv2→Lv3" },
    { "名称": "意式烩饭", "厨具": "蒸锅", "价格/円": "70", "食材": "洋葱、蘑菇、竹笋、黄油", "正特性": "昂贵、饱腹、鲜、菌类、西式", "反特性": "甜", "时间（1级）": "6", "时间（50级）": "3.6", "等级": "2", "获取方式": "帕秋莉Lv2→Lv3" },
    { "名称": "赛熊掌", "厨具": "蒸锅", "价格/円": "70", "食材": "河豚、黑毛猪肉、竹笋", "正特性": "昂贵、肉、水产、高级、鲜、山珍、不可思议、力量涌现", "反特性": "", "时间（1级）": "12", "时间（50级）": "7.2", "等级": "3", "获取方式": "露米娅Lv3→Lv4" },
    { "名称": "蜜汁叉烧", "厨具": "烤架", "价格/円": "70", "食材": "猪肉、蜂蜜", "正特性": "昂贵、肉、重油、甜、不可思议、中华", "反特性": "", "时间（1级）": "7", "时间（50级）": "4.2", "等级": "3", "获取方式": "红魔馆支线" },
    { "名称": "毛玉三色冰激凌", "厨具": "料理台", "价格/円": "75", "食材": "豆腐、鸡蛋、蜂蜜、露水", "正特性": "昂贵、甜、凉爽、梦幻、适合拍照、西式", "反特性": "", "时间（1级）": "8", "时间（50级）": "4.8", "等级": "3", "获取方式": "妖怪兽道萌澄果处购买" },
    { "名称": "幻昙花糕", "厨具": "蒸锅", "价格/円": "78", "食材": "幻昙华、露水", "正特性": "昂贵、高级、传说、甜、梦幻、适合拍照", "反特性": "肉、水产", "时间（1级）": "7", "时间（50级）": "4.2", "等级": "3", "获取方式": "莉格露Lv3→Lv4" },
    { "名称": "猪鹿蝶", "厨具": "蒸锅", "价格/円": "78", "食材": "鹿肉、野猪肉、月光草", "正特性": "昂贵、肉、高级、适合拍照、文化底蕴", "反特性": "", "时间（1级）": "8", "时间（50级）": "4.8", "等级": "3", "获取方式": "琪露诺Lv3→Lv4" },
    { "名称": "月光团子", "厨具": "料理台", "价格/円": "80", "食材": "糯米、月光草", "正特性": "昂贵、甜、不可思议、特产、和风", "反特性": "肉、水产、咸、鲜", "时间（1级）": "8", "时间（50级）": "4.8", "等级": "3", "获取方式": "因幡帝Lv3→Lv4" },
    { "名称": "毛玉熔岩豆腐", "厨具": "料理台", "价格/円": "85", "食材": "牛肉、豆腐、洋葱、辣椒", "正特性": "昂贵、素、鲜、不可思议、适合拍照、中华", "反特性": "", "时间（1级）": "8", "时间（50级）": "4.8", "等级": "3", "获取方式": "妖怪兽道萌澄果处购买" },
    { "名称": "刺身拼盘", "厨具": "料理台", "价格/円": "88", "食材": "三文鱼、金枪鱼", "正特性": "昂贵、水产、高级、生、适合拍照、和风", "反特性": "灼热", "时间（1级）": "5", "时间（50级）": "3", "等级": "3", "获取方式": "琪露诺Lv2→Lv3" },
    { "名称": "二天一流", "厨具": "烤架", "价格/円": "90", "食材": "野猪肉、黑毛猪肉", "正特性": "昂贵、肉、高级、山珍、燃起来了、文化底蕴、烧烤", "反特性": "家常", "时间（1级）": "18", "时间（50级）": "10.8", "等级": "4", "获取方式": "伊吹萃香Lv3→Lv4" },
    { "名称": "白雪", "厨具": "煮锅", "价格/円": "98", "食材": "八目鳗、河豚、海苔", "正特性": "昂贵、肉、水产、高级、文化底蕴、和风", "反特性": "", "时间（1级）": "12", "时间（50级）": "7.2", "等级": "4", "获取方式": "上白泽慧音Lv3→Lv4" },
    { "名称": "大奢宴", "厨具": "煮锅", "价格/円": "105", "食材": "河豚、黑毛猪肉、和牛", "正特性": "昂贵、肉、水产、饱腹、高级、山珍", "反特性": "实惠、家常", "时间（1级）": "10", "时间（50级）": "6", "等级": "3", "获取方式": "博丽灵梦Lv3→Lv4" },
    { "名称": "岩浆", "厨具": "煮锅", "价格/円": "125", "食材": "河豚、牛肉、和牛、松露", "正特性": "昂贵、肉、水产、饱腹、高级、灼热、力量涌现、菌类", "反特性": "凉爽", "时间（1级）": "8", "时间（50级）": "4.8", "等级": "3", "获取方式": "藤原妹红Lv3→Lv4" },
    { "名称": "蓬莱玉枝", "厨具": "烤架", "价格/円": "125", "食材": "三文鱼、猪肉、鹿肉、和牛、竹子", "正特性": "昂贵、肉、高级、传说、文化底蕴、烧烤", "反特性": "", "时间（1级）": "13", "时间（50级）": "7.8", "等级": "5", "获取方式": "蓬莱山辉夜Lv3→Lv4" },
    { "名称": "华光玉煎包", "厨具": "油锅", "价格/円": "128", "食材": "黑毛猪肉、蘑菇", "正特性": "昂贵、肉、高级、传说、梦幻、菌类、中华", "反特性": "", "时间（1级）": "8", "时间（50级）": "4.8", "等级": "4", "获取方式": "红美铃Lv3→Lv4" },
    { "名称": "惠灵顿牛排", "厨具": "油锅", "价格/円": "150", "食材": "和牛、松露、鸡蛋、黄油、面粉", "正特性": "昂贵、肉、高级、传说、山珍、西式", "反特性": "甜、凉爽", "时间（1级）": "14", "时间（50级）": "8.4", "等级": "4", "获取方式": "帕秋莉Lv3→Lv4" },
    { "名称": "【DLC1】腌黄瓜", "厨具": "料理台", "价格/円": "16", "食材": "黄瓜、黑盐", "正特性": "实惠、素、下酒、小巧、咸", "反特性": "", "时间（1级）": "6", "时间（50级）": "3.6", "等级": "1", "获取方式": "【DLC1】河城荷取Lv1→Lv2" },
    { "名称": "【DLC1】蘑菇肉片", "厨具": "油锅", "价格/円": "20", "食材": "猪肉、蘑菇", "正特性": "家常、肉、重油、菌类", "反特性": "", "时间（1级）": "6", "时间（50级）": "3.6", "等级": "1", "获取方式": "【DLC1】雾雨魔理沙Lv1→Lv2" },
    { "名称": "【DLC1】炸虾天妇罗", "厨具": "油锅", "价格/円": "22", "食材": "虾、面粉", "正特性": "下酒、重油", "反特性": "清淡", "时间（1级）": "6", "时间（50级）": "3.6", "等级": "1", "获取方式": "【DLC1】犬走椛Lv1→Lv2" },
    { "名称": "【DLC1】大阪烧", "厨具": "油锅", "价格/円": "24", "食材": "萝卜、鸡蛋、面粉", "正特性": "招牌、小巧、适合拍照、和风", "反特性": "", "时间（1级）": "6", "时间（50级）": "3.6", "等级": "2", "获取方式": "【DLC1】东风谷早苗Lv1→Lv2" },
    { "名称": "【DLC1】奶香蘑菇汤", "厨具": "煮锅", "价格/円": "28", "食材": "土豆、蘑菇、奶油", "正特性": "家常、适合拍照、菌类", "反特性": "", "时间（1级）": "8", "时间（50级）": "4.8", "等级": "1", "获取方式": "【DLC1】爱丽丝Lv1→Lv2" },
    { "名称": "【DLC1】手握寿司", "厨具": "料理台", "价格/円": "28", "食材": "三文鱼、金枪鱼", "正特性": "水产、清淡、鲜、生、文化底蕴、和风", "反特性": "", "时间（1级）": "6", "时间（50级）": "3.6", "等级": "1", "获取方式": "【DLC1】矢田寺成美Lv1→Lv2" },
    { "名称": "【DLC1】章鱼烧", "厨具": "油锅", "价格/円": "36", "食材": "海苔、面粉、章鱼", "正特性": "招牌、水产、饱腹、小巧、适合拍照", "反特性": "", "时间（1级）": "8", "时间（50级）": "4.8", "等级": "2", "获取方式": "【DLC1】东风谷早苗Lv2→Lv3" },
    { "名称": "【DLC1】黄金酥鱼饼", "厨具": "油锅", "价格/円": "40", "食材": "鳟鱼、蜂蜜、面粉", "正特性": "水产、下酒、重油、力量涌现", "反特性": "", "时间（1级）": "9", "时间（50级）": "5.4", "等级": "2", "获取方式": "【DLC1】犬走椛Lv2→Lv3" },
    { "名称": "【DLC1】南瓜虾盅", "厨具": "蒸锅", "价格/円": "55", "食材": "虾、豆腐、南瓜", "正特性": "水产、饱腹、清淡、甜、鲜、适合拍照、特产", "反特性": "", "时间（1级）": "9", "时间（50级）": "5.4", "等级": "2", "获取方式": "【DLC1】矢田寺成美Lv2→Lv3" },
    { "名称": "【DLC1】普通小蛋糕", "厨具": "蒸锅", "价格/円": "56", "食材": "鸡蛋、葡萄、奶油", "正特性": "高级、甜、果味、适合拍照、文化底蕴", "反特性": "", "时间（1级）": "8", "时间（50级）": "4.8", "等级": "2", "获取方式": "【DLC1】爱丽丝Lv2→Lv3" },
    { "名称": "【DLC1】秘制鲜菌煲", "厨具": "煮锅", "价格/円": "62", "食材": "蘑菇、松露、露水", "正特性": "昂贵、鲜、菌类、特产、和风", "反特性": "", "时间（1级）": "9", "时间（50级）": "5.4", "等级": "3", "获取方式": "【DLC1】雾雨魔理沙Lv2→Lv3" },
    { "名称": "【DLC1】奶油焗蟹", "厨具": "油锅", "价格/円": "88", "食材": "螃蟹、奶油", "正特性": "昂贵、招牌、下酒、高级、鲜、海味、适合拍照", "反特性": "", "时间（1级）": "12", "时间（50级）": "7.2", "等级": "3", "获取方式": "【DLC1】河城荷取Lv2→Lv3" },
    { "名称": "【DLC1】七色羊羹", "厨具": "蒸锅", "价格/円": "92", "食材": "海苔、幻昙华、露水、葡萄", "正特性": "昂贵、高级、甜、果味、梦幻、不可思议、适合拍照、文化底蕴", "反特性": "", "时间（1级）": "8", "时间（50级）": "4.8", "等级": "4", "获取方式": "【DLC1】爱丽丝Lv3→Lv4" },
    { "名称": "【DLC1】海胆刺身", "厨具": "料理台", "价格/円": "108", "食材": "露水、海胆", "正特性": "昂贵、小巧、高级、甜、海味、不可思议、适合拍照、特产", "反特性": "", "时间（1级）": "8", "时间（50级）": "4.8", "等级": "4", "获取方式": "【DLC1】东风谷早苗Lv3→Lv4" },
    { "名称": "【DLC1】蘑女的舞踏烩", "厨具": "煮锅", "价格/円": "112", "食材": "虾、蘑菇、辣椒、章鱼", "正特性": "昂贵、水产、重油、辣、咸、鲜、灼热、适合拍照、菌类", "反特性": "", "时间（1级）": "14", "时间（50级）": "8.4", "等级": "4", "获取方式": "【DLC1】雾雨魔理沙Lv3→Lv4" },
    { "名称": "【DLC1】全肉盛宴", "厨具": "烤架", "价格/円": "115", "食材": "鹿肉、野猪肉、黑毛猪肉、和牛", "正特性": "昂贵、肉、下酒、大份、高级、咸、山珍、灼热、适合拍照", "反特性": "", "时间（1级）": "14", "时间（50级）": "8.4", "等级": "4", "获取方式": "【DLC1】犬走椛Lv3→Lv4" },
    { "名称": "【DLC1】拟尻子玉", "厨具": "煮锅", "价格/円": "120", "食材": "鹿肉、松露、蝉蜕", "正特性": "昂贵、下酒、小巧、传说、梦幻、猎奇、灼热", "反特性": "", "时间（1级）": "12", "时间（50级）": "7.2", "等级": "4", "获取方式": "【DLC1】河城荷取Lv3→Lv4" },
    { "名称": "【DLC1】幻想佛跳墙", "厨具": "煮锅", "价格/円": "160", "食材": "极上金枪鱼、河豚、黑毛猪肉、和牛、松露", "正特性": "昂贵、肉、水产、高级、传说、山珍、力量涌现、适合拍照、文化底蕴、菌类、特产、中华", "反特性": "", "时间（1级）": "18", "时间（50级）": "10.8", "等级": "4", "获取方式": "【DLC1】矢田寺成美Lv3→Lv4" },
    { "名称": "【DLC2】丧气芝士条", "厨具": "蒸锅", "价格/円": "25", "食材": "白果、白果、芝士", "正特性": "下酒、咸、鲜、特产", "反特性": "", "时间（1级）": "6", "时间（50级）": "3.6", "等级": "1", "获取方式": "【DLC2】水桥帕露西Lv1→Lv2" },
    { "名称": "【DLC2】芝士蛋", "厨具": "油锅", "价格/円": "26", "食材": "鸡蛋、芝士", "正特性": "重油、咸、鲜、生", "反特性": "肉", "时间（1级）": "6", "时间（50级）": "3.6", "等级": "1", "获取方式": "【DLC2】灵乌路空Lv1→Lv2" },
    { "名称": "【DLC2】猫饭", "厨具": "料理台", "价格/円": "26", "食材": "鳟鱼、露水、面粉", "正特性": "水产、小巧、鲜", "反特性": "重油", "时间（1级）": "5", "时间（50级）": "3", "等级": "1", "获取方式": "【DLC2】火焰猫燐Lv1→Lv2" },
    { "名称": "【DLC2】狮子头", "厨具": "煮锅", "价格/円": "28", "食材": "牛肉", "正特性": "招牌、肉、下酒、鲜、特产", "反特性": "水产、饱腹", "时间（1级）": "7", "时间（50级）": "4.2", "等级": "1", "获取方式": "【DLC2】星熊勇仪Lv1→Lv2" },
    { "名称": "【DLC2】樱花布丁", "厨具": "蒸锅", "价格/円": "32", "食材": "桃子、蜂蜜", "正特性": "小巧、甜、果味、凉爽、适合拍照、特产", "反特性": "重油、咸", "时间（1级）": "6", "时间（50级）": "3.6", "等级": "2", "获取方式": "【DLC2】古明地觉Lv1→Lv2" },
    { "名称": "【DLC2】阴郁水果派", "厨具": "料理台", "价格/円": "36", "食材": "葡萄、柠檬、芝士", "正特性": "酸、咸、鲜、果味、特产", "反特性": "", "时间（1级）": "8", "时间（50级）": "4.8", "等级": "2", "获取方式": "【DLC2】水桥帕露西Lv2→Lv3" },
    { "名称": "【DLC2】提神布丁", "厨具": "蒸锅", "价格/円": "42", "食材": "葡萄、葡萄、柠檬", "正特性": "小巧、酸、甜、果味、凉爽、力量涌现", "反特性": "重油、咸", "时间（1级）": "8", "时间（50级）": "4.8", "等级": "2", "获取方式": "【DLC2】古明地觉Lv2→Lv3" },
    { "名称": "【DLC2】脆旋风", "厨具": "料理台", "价格/円": "42", "食材": "蜂蜜、蝉蜕、面粉", "正特性": "饱腹、生、猎奇、特产", "反特性": "重油", "时间（1级）": "5", "时间（50级）": "3", "等级": "1", "获取方式": "【DLC2】黑谷山女Lv1→Lv2" },
    { "名称": "【DLC2】三文鱼天妇罗", "厨具": "油锅", "价格/円": "44", "食材": "三文鱼、鸡蛋、黄油、面粉", "正特性": "水产、重油、小巧、高级、鲜", "反特性": "", "时间（1级）": "8", "时间（50级）": "4.8", "等级": "2", "获取方式": "【DLC2】火焰猫燐Lv2→Lv3" },
    { "名称": "【DLC2】巨人玉子烧", "厨具": "油锅", "价格/円": "60", "食材": "鸡蛋、鸡蛋、面粉、面粉", "正特性": "饱腹、高级、甜、力量涌现、和风", "反特性": "下酒", "时间（1级）": "12", "时间（50级）": "7.2", "等级": "2", "获取方式": "【DLC2】星熊勇仪Lv2→Lv3" },
    { "名称": "【DLC2】一击☆必杀", "厨具": "烤架", "价格/円": "62", "食材": "鹿肉、野猪肉、洋葱", "正特性": "昂贵、肉、饱腹、重油、山珍、力量涌现、烧烤", "反特性": "", "时间（1级）": "9", "时间（50级）": "5.4", "等级": "3", "获取方式": "【DLC2】灵乌路空Lv2→Lv3" },
    { "名称": "【DLC2】仰望天花板派", "厨具": "蒸锅", "价格/円": "66", "食材": "鳟鱼、桃子、面粉", "正特性": "昂贵、招牌、下酒、海味、猎奇、适合拍照、特产", "反特性": "肉", "时间（1级）": "9", "时间（50级）": "5.4", "等级": "2", "获取方式": "【DLC2】黑谷山女Lv2→Lv3" },
    { "名称": "【DLC2】燃尽布丁", "厨具": "蒸锅", "价格/円": "73", "食材": "蜂蜜、葡萄、柠檬、柠檬", "正特性": "昂贵、招牌、小巧、酸、甜、果味、凉爽、梦幻、力量涌现", "反特性": "重油、咸", "时间（1级）": "8", "时间（50级）": "4.8", "等级": "4", "获取方式": "【DLC2】古明地觉Lv3→Lv4" },
    { "名称": "【DLC2】绝叫关东煮", "厨具": "煮锅", "价格/円": "92", "食材": "牛肉、豆腐、萝卜、辣椒、辣椒", "正特性": "昂贵、肉、饱腹、大份、高级、辣、鲜、灼热、力量涌现、特产", "反特性": "", "时间（1级）": "12", "时间（50级）": "7.2", "等级": "4", "获取方式": "【DLC2】水桥帕露西Lv3→Lv4" },
    { "名称": "【DLC2】兜甲蒸糕", "厨具": "蒸锅", "价格/円": "105", "食材": "黑毛猪肉、蜂蜜、蝉蜕、面粉", "正特性": "昂贵、招牌、饱腹、高级、鲜、生、猎奇、力量涌现、适合拍照、特产", "反特性": "", "时间（1级）": "12", "时间（50级）": "7.2", "等级": "3", "获取方式": "【DLC2】黑谷山女Lv3→Lv4" },
    { "名称": "【DLC2】地狱激辛警告！", "厨具": "油锅", "价格/円": "108", "食材": "牛肉、辣椒、辣椒、辣椒、芝士", "正特性": "昂贵、肉、重油、辣、咸、猎奇、灼热、力量涌现、适合拍照", "反特性": "素、清淡", "时间（1级）": "12", "时间（50级）": "7.2", "等级": "4", "获取方式": "【DLC2】灵乌路空Lv3→Lv4" },
    { "名称": "【DLC2】鱼跃龙门", "厨具": "蒸锅", "价格/円": "142", "食材": "极上金枪鱼、鹿肉、松露、蜂蜜、月光草", "正特性": "昂贵、肉、水产、大份、高级、甜、鲜、海味、梦幻、文化底蕴、菌类、中华", "反特性": "", "时间（1级）": "12", "时间（50级）": "7.2", "等级": "4", "获取方式": "【DLC2】火焰猫燐Lv3→Lv4" },
    { "名称": "【DLC2】大江户船祭", "厨具": "料理台", "价格/円": "206", "食材": "鳟鱼、三文鱼、金枪鱼、极上金枪鱼、冰块", "正特性": "昂贵、招牌、水产、下酒、高级、传说、鲜、生、海味、适合拍照、文化底蕴、和风", "反特性": "", "时间（1级）": "24", "时间（50级）": "14.4", "等级": "4", "获取方式": "【DLC2】星熊勇仪Lv3→Lv4" },
    { "名称": "【DLC3】云山棉花糖", "厨具": "油锅", "价格/円": "20", "食材": "桃子、蜂蜜", "正特性": "甜、果味、不可思议、特产", "反特性": "肉、咸", "时间（1级）": "8", "时间（50级）": "4.8", "等级": "1", "获取方式": "【DLC3】封兽鵺Lv1→Lv2" },
    { "名称": "【DLC3】烤地瓜", "厨具": "烤架", "价格/円": "25", "食材": "地瓜", "正特性": "实惠、家常、饱腹、甜", "反特性": "下酒", "时间（1级）": "6", "时间（50级）": "3.6", "等级": "1", "获取方式": "【DLC3】多多良小伞Lv1→Lv2" },
    { "名称": "【DLC3】比斯开湾饼干", "厨具": "烤架", "价格/円": "26", "食材": "面粉、芝士", "正特性": "饱腹、咸、灼热", "反特性": "酸", "时间（1级）": "5", "时间（50级）": "3", "等级": "1", "获取方式": "【DLC3】村纱水蜜Lv1→Lv2" },
    { "名称": "【DLC3】拔丝地瓜", "厨具": "油锅", "价格/円": "30", "食材": "蜂蜜、地瓜", "正特性": "家常、素、饱腹、甜", "反特性": "生", "时间（1级）": "6", "时间（50级）": "3.6", "等级": "1", "获取方式": "【DLC3】苏我屠自古Lv1→Lv2" },
    { "名称": "【DLC3】蜜饯栗子", "厨具": "料理台", "价格/円": "30", "食材": "蜂蜜、板栗", "正特性": "小巧、甜、特产", "反特性": "", "时间（1级）": "6", "时间（50级）": "3.6", "等级": "1", "获取方式": "【DLC3】霍青娥Lv1→Lv2" },
    { "名称": "【DLC3】瘦马团子", "厨具": "料理台", "价格/円": "45", "食材": "糯米、糯米", "正特性": "饱腹、猎奇、适合拍照、文化底蕴", "反特性": "肉", "时间（1级）": "9", "时间（50级）": "5.4", "等级": "2", "获取方式": "【DLC3】多多良小伞Lv2→Lv3" },
    { "名称": "【DLC3】松子糕", "厨具": "蒸锅", "价格/円": "46", "食材": "糯米、松子", "正特性": "清淡、特产", "反特性": "", "时间（1级）": "8", "时间（50级）": "4.8", "等级": "2", "获取方式": "【DLC3】物部布都Lv1→Lv2" },
    { "名称": "【DLC3】天师板栗焖菇", "厨具": "煮锅", "价格/円": "55", "食材": "蘑菇、松露、板栗", "正特性": "家常、素、菌类、特产、中华", "反特性": "", "时间（1级）": "8", "时间（50级）": "4.8", "等级": "2", "获取方式": "【DLC3】霍青娥Lv2→Lv3" },
    { "名称": "【DLC3】圣白莲子糕", "厨具": "蒸锅", "价格/円": "56", "食材": "白果、黄油、面粉、莲子", "正特性": "素、清淡、小巧、适合拍照、特产", "反特性": "辣", "时间（1级）": "10", "时间（50级）": "6", "等级": "2", "获取方式": "【DLC3】封兽鵺Lv2→Lv3" },
    { "名称": "【DLC3】海盗熏肉", "厨具": "烤架", "价格/円": "58", "食材": "牛肉、蜂蜜、辣椒、黑盐", "正特性": "肉、大份、传说、力量涌现、特产", "反特性": "酸", "时间（1级）": "9", "时间（50级）": "5.4", "等级": "2", "获取方式": "【DLC3】村纱水蜜Lv2→Lv3" },
    { "名称": "【DLC3】香煎双菇肉卷", "厨具": "油锅", "价格/円": "63", "食材": "猪肉、蘑菇、松露", "正特性": "昂贵、招牌、家常、肉、下酒、重油、灼热、菌类", "反特性": "凉爽", "时间（1级）": "9", "时间（50级）": "5.4", "等级": "3", "获取方式": "【DLC3】苏我屠自古Lv2→Lv3" },
    { "名称": "【DLC3】白鹿贞松", "厨具": "蒸锅", "价格/円": "72", "食材": "鹿肉、白果、松子", "正特性": "昂贵、肉、高级、山珍、文化底蕴、特产", "反特性": "酸", "时间（1级）": "12", "时间（50级）": "7.2", "等级": "3", "获取方式": "【DLC3】物部布都Lv2→Lv3" },
    { "名称": "【DLC3】什锦天妇罗", "厨具": "油锅", "价格/円": "72", "食材": "八目鳗、黑毛猪肉、松露、月光草", "正特性": "昂贵、招牌、家常、下酒、重油、力量涌现、菌类、和风", "反特性": "", "时间（1级）": "7", "时间（50级）": "4.2", "等级": "3", "获取方式": "【DLC3】苏我屠自古Lv3→Lv4" },
    { "名称": "【DLC3】惊吓！大冒险", "厨具": "蒸锅", "价格/円": "90", "食材": "蘑菇、蜂蜜、幻昙华、奶油", "正特性": "昂贵、梦幻、猎奇、不可思议、力量涌现、适合拍照、特产", "反特性": "家常", "时间（1级）": "12", "时间（50级）": "7.2", "等级": "4", "获取方式": "【DLC3】多多良小伞Lv3→Lv4" },
    { "名称": "【DLC3】荷花鱼米盏", "厨具": "蒸锅", "价格/円": "94", "食材": "极上金枪鱼、露水、并蒂莲、莲子", "正特性": "昂贵、水产、清淡、传说、梦幻、不可思议、文化底蕴、中华", "反特性": "", "时间（1级）": "11", "时间（50级）": "6.6", "等级": "4", "获取方式": "【DLC3】霍青娥Lv3→Lv4" },
    { "名称": "【DLC3】罗汉上素", "厨具": "煮锅", "价格/円": "97", "食材": "松露、竹笋、幻昙华、莲子、松子", "正特性": "昂贵、素、清淡、高级、鲜、凉爽、梦幻、文化底蕴、特产", "反特性": "肉、辣", "时间（1级）": "12", "时间（50级）": "7.2", "等级": "4", "获取方式": "【DLC3】村纱水蜜Lv3→Lv4" },
    { "名称": "【DLC3】幻想星莲船", "厨具": "料理台", "价格/円": "132", "食材": "金枪鱼、南瓜、月光草、并蒂莲、莲子", "正特性": "昂贵、招牌、高级、鲜、生、凉爽、梦幻、不可思议、适合拍照、特产", "反特性": "猎奇", "时间（1级）": "13", "时间（50级）": "7.8", "等级": "4", "获取方式": "【DLC3】封兽鵺Lv3→Lv4" },
    { "名称": "【DLC3】太极八卦鱼肚", "厨具": "煮锅", "价格/円": "136", "食材": "极上金枪鱼、萝卜、蘑菇、鸡蛋、白果", "正特性": "昂贵、水产、清淡、高级、鲜、凉爽、文化底蕴", "反特性": "", "时间（1级）": "14", "时间（50级）": "8.4", "等级": "4", "获取方式": "【DLC3】物部布都Lv3→Lv4" },
    { "名称": "【DLC4】绿野仙菇", "厨具": "煮锅", "价格/円": "24", "食材": "蘑菇、香椿", "正特性": "清淡、文化底蕴、菌类、特产", "反特性": "", "时间（1级）": "6", "时间（50级）": "3.6", "等级": "1", "获取方式": "【DLC4】风见幽香Lv1→Lv2" },
    { "名称": "【DLC4】炸番茄条", "厨具": "油锅", "价格/円": "26", "食材": "土豆、西红柿", "正特性": "小巧、猎奇、不可思议", "反特性": "水产", "时间（1级）": "6", "时间（50级）": "3.6", "等级": "1", "获取方式": "【DLC4】鬼人正邪Lv1→Lv2" },
    { "名称": "【DLC4】红豆大福", "厨具": "料理台", "价格/円": "28", "食材": "糯米、红豆", "正特性": "小巧、甜、和风", "反特性": "", "时间（1级）": "7", "时间（50级）": "4.2", "等级": "2", "获取方式": "【DLC4】少名针妙丸Lv1→Lv2" },
    { "名称": "【DLC4】香椿煎饼", "厨具": "油锅", "价格/円": "30", "食材": "鸡蛋、香椿", "正特性": "招牌、特产", "反特性": "", "时间（1级）": "6", "时间（50级）": "3.6", "等级": "1", "获取方式": "【DLC4】梅蒂欣Lv1→Lv2" },
    { "名称": "【DLC4】梅子茶泡饭", "厨具": "煮锅", "价格/円": "32", "食材": "海苔、梅子", "正特性": "家常、和风", "反特性": "", "时间（1级）": "4", "时间（50级）": "2.4", "等级": "1", "获取方式": "【DLC4】射命丸文Lv1→Lv2" },
    { "名称": "【DLC4】铜锣烧", "厨具": "油锅", "价格/円": "40", "食材": "鸡蛋、面粉、红豆", "正特性": "素、甜、特产、和风", "反特性": "肉", "时间（1级）": "6", "时间（50级）": "3.6", "等级": "2", "获取方式": "【DLC4】少名针妙丸Lv2→Lv3" },
    { "名称": "【DLC4】石锅竹笋炖肉", "厨具": "煮锅", "价格/円": "42", "食材": "牛肉、竹笋、竹子", "正特性": "家常、肉、饱腹", "反特性": "", "时间（1级）": "7", "时间（50级）": "4.2", "等级": "3", "获取方式": "【DLC4】今泉影狼Lv1→Lv2" },
    { "名称": "【DLC4】蜜桃红烧肉", "厨具": "油锅", "价格/円": "42", "食材": "猪肉、桃子、蜂蜜", "正特性": "肉、下酒、果味、不可思议", "反特性": "", "时间（1级）": "8", "时间（50级）": "4.8", "等级": "2", "获取方式": "【DLC4】鬼人正邪Lv2→Lv3" },
    { "名称": "【DLC4】毒瘴花园", "厨具": "煮锅", "价格/円": "58", "食材": "八目鳗、河豚、白果、梅子", "正特性": "招牌、水产、毒、猎奇", "反特性": "", "时间（1级）": "8", "时间（50级）": "4.8", "等级": "3", "获取方式": "【DLC4】梅蒂欣Lv2→Lv3" },
    { "名称": "【DLC4】竹筒粉蒸肉", "厨具": "蒸锅", "价格/円": "72", "食材": "黑毛猪肉、露水、竹子", "正特性": "昂贵、家常、肉、山珍", "反特性": "生", "时间（1级）": "9", "时间（50级）": "5.4", "等级": "3", "获取方式": "【DLC4】今泉影狼Lv2→Lv3" },
    { "名称": "【DLC4】花鸟风月", "厨具": "蒸锅", "价格/円": "78", "食材": "月光草、奶油、鲜花", "正特性": "昂贵、高级、梦幻、不可思议、特产", "反特性": "重油、灼热", "时间（1级）": "9", "时间（50级）": "5.4", "等级": "3", "获取方式": "【DLC4】风见幽香Lv2→Lv3" },
    { "名称": "【DLC4】小小的甜蜜「毒药」", "厨具": "蒸锅", "价格/円": "87", "食材": "白果、幻昙华、葡萄、奶油", "正特性": "昂贵、小巧、高级、甜、梦幻、适合拍照", "反特性": "肉", "时间（1级）": "10", "时间（50级）": "6", "等级": "3", "获取方式": "【DLC4】梅蒂欣Lv3→Lv4" },
    { "名称": "【DLC4】翠竹迎春", "厨具": "蒸锅", "价格/円": "99", "食材": "鹿肉、萝卜、鸡蛋、月光草、黄瓜", "正特性": "昂贵、招牌、高级、山珍、适合拍照、文化底蕴", "反特性": "猎奇、菌类", "时间（1级）": "14", "时间（50级）": "8.4", "等级": "4", "获取方式": "【DLC4】今泉影狼Lv3→Lv4" },
    { "名称": "【DLC4】海胆蒸蛋", "厨具": "蒸锅", "价格/円": "112", "食材": "鸡蛋、海胆", "正特性": "昂贵、鲜、海味、适合拍照", "反特性": "山珍", "时间（1级）": "7", "时间（50级）": "4.2", "等级": "3", "获取方式": "【DLC4】射命丸文Lv2→Lv3" },
    { "名称": "【DLC4】汉宫藏娇", "厨具": "煮锅", "价格/円": "115", "食材": "八目鳗、豆腐、露水、竹子、螃蟹", "正特性": "昂贵、水产、高级、传说、猎奇、文化底蕴、汤羹、中华", "反特性": "重油", "时间（1级）": "12", "时间（50级）": "7.2", "等级": "4", "获取方式": "【DLC4】少名针妙丸Lv3→Lv4" },
    { "名称": "【DLC4】逆转天地！", "厨具": "料理台", "价格/円": "124", "食材": "黑毛猪肉、松露、竹子、梅子、鲜花", "正特性": "昂贵、山珍、凉爽、梦幻、猎奇、不可思议、燃起来了、菌类", "反特性": "", "时间（1级）": "12", "时间（50级）": "7.2", "等级": "4", "获取方式": "【DLC4】鬼人正邪Lv3→Lv4" },
    { "名称": "【DLC4】幽梦", "厨具": "蒸锅", "价格/円": "133", "食材": "幻昙华、露水、月光草、奶油、鲜花", "正特性": "昂贵、清淡、高级、甜、凉爽、梦幻、适合拍照、西式", "反特性": "肉、水产、下酒", "时间（1级）": "12", "时间（50级）": "7.2", "等级": "4", "获取方式": "【DLC4】风见幽香Lv3→Lv4" },
    { "名称": "【DLC4】幻想风靡", "厨具": "烤架", "价格/円": "185", "食材": "牛肉、野猪肉、洋葱、松露、西红柿", "正特性": "昂贵、招牌、肉、饱腹、重油、生、力量涌现、适合拍照", "反特性": "清淡、凉爽", "时间（1级）": "18", "时间（50级）": "10.8", "等级": "5", "获取方式": "【DLC4】射命丸文Lv3→Lv4" },
]

var 食材 = [
    { "名称": "鳟鱼", "类别": "海鲜", "特性": "水产、鲜", "": "", "获取方式（仅采集和购买）": "妖怪兽道河流处（概率）、妖怪之山中心瀑布处、辉针城碗之后处（概率）采集，旧地狱鬼商处购买" },
    { "名称": "八目鳗", "类别": "海鲜", "特性": "水产、招牌、鲜", "": "", "获取方式（仅采集和购买）": "妖怪兽道河流处（概率）、妖怪之山中心瀑布处（概率）、神灵庙水涡处、辉针城水涡处、辉针城碗之后处（概率）采集，辉针城不良少年处购买" },
    { "名称": "三文鱼", "类别": "海鲜", "特性": "水产、高级、鲜", "": "", "获取方式（仅采集和购买）": "非妖怪兽道河流处（概率）、神灵庙水涡处、辉针城水涡处、辉针城碗之后处（概率）采集，妖怪兽道商人处（概率）、旧地狱鬼商处、神灵庙道士处购买" },
    { "名称": "金枪鱼", "类别": "海鲜", "特性": "水产、高级、鲜", "": "", "获取方式（仅采集和购买）": "非妖怪兽道河流处（概率）、神灵庙水涡处、辉针城碗之后处（概率）采集，神灵庙道士处购买" },
    { "名称": "极上金枪鱼", "类别": "海鲜", "特性": "水产、高级、传说、鲜、海味", "": "", "获取方式（仅采集和购买）": "红魔馆河流处（概率）、迷途竹林水涡处、妖怪之山南侧瀑布处（概率）、辉针城水涡处（概率）、辉针城碗之后处（概率）采集，博丽神社妖精女仆处、红魔馆地精处购买" },
    { "名称": "河豚", "类别": "海鲜", "特性": "水产、鲜、海味", "": "", "获取方式（仅采集和购买）": "红魔馆河流处（概率）、地灵殿水池处采集，博丽神社妖精女仆处、红魔馆地精处、迷途竹林妖怪兔处、神灵庙道士处购买" },
    { "名称": "虾", "类别": "海鲜", "特性": "水产、鲜", "": "", "获取方式（仅采集和购买）": "非妖怪兽道河流处（概率）、命莲寺东北莲花池处、神灵庙水涡处采集" },
    { "名称": "猪肉", "类别": "肉类", "特性": "肉", "": "", "获取方式（仅采集和购买）": "妖怪之山捕兽夹处（概率）采集，妖怪兽道商人处、人间之里农户处购买" },
    { "名称": "牛肉", "类别": "肉类", "特性": "肉", "": "", "获取方式（仅采集和购买）": "妖怪兽道商人处、人间之里农户处、魔法森林上海人形处、旧地狱鬼商处购买" },
    { "名称": "鹿肉", "类别": "肉类", "特性": "肉", "": "", "获取方式（仅采集和购买）": "妖怪兽道捕兽夹处（概率）采集，迷途竹林妖怪兔处、神灵庙道士处购买" },
    { "名称": "野猪肉", "类别": "肉类", "特性": "肉", "": "", "获取方式（仅采集和购买）": "妖怪兽道、妖怪之山捕兽夹处（概率）采集，博丽神社妖精女仆处、辉针城不良少年处购买" },
    { "名称": "黑毛猪肉", "类别": "肉类", "特性": "肉、传说、山珍", "": "", "获取方式（仅采集和购买）": "妖怪兽道（概率）、妖怪之山（概率）、旧地狱捕兽夹处采集，博丽神社妖精女仆处、旧地狱鬼商处购买" },
    { "名称": "和牛", "类别": "肉类", "特性": "肉、高级、传说", "": "", "获取方式（仅采集和购买）": "旧地狱捕兽夹处采集，博丽神社妖精女仆处、红魔馆地精处、神灵庙道士处购买" },
    { "名称": "豆腐", "类别": "蔬菜", "特性": "素、家常、清淡", "": "", "获取方式（仅采集和购买）": "香霖堂处（概率）、妖怪兽道商人处、人间之里农户处、地灵殿地狱鸦处购买" },
    { "名称": "土豆", "类别": "蔬菜", "特性": "素、家常", "": "", "获取方式（仅采集和购买）": "妖怪兽道花丛处、博丽神社花丛处、妖怪之山花丛处采集，妖怪兽道商人处、人间之里农户处购买" },
    { "名称": "洋葱", "类别": "蔬菜", "特性": "素、鲜", "": "", "获取方式（仅采集和购买）": "人间之里农田处采集，妖怪兽道商人处、人间之里农户处购买" },
    { "名称": "南瓜", "类别": "蔬菜", "特性": "素、饱腹", "": "", "获取方式（仅采集和购买）": "人间之里农田处采集，妖怪兽道商人处、人间之里农户处、魔法森林上海人形处购买" },
    { "名称": "萝卜", "类别": "蔬菜", "特性": "素、下酒", "": "", "获取方式（仅采集和购买）": "妖怪兽道、魔法森林花丛处、人间之里农田处、太阳花田温室处采集，妖怪兽道商人处、人间之里农户处购买" },
    { "名称": "海苔", "类别": "蔬菜", "特性": "素、鲜", "": "", "获取方式（仅采集和购买）": "非迷途竹林河流处采集，妖怪兽道商人处、人间之里农户处购买" },
    { "名称": "蘑菇", "类别": "蔬菜", "特性": "素、鲜、菌类", "": "", "获取方式（仅采集和购买）": "妖怪兽道、红魔馆露水处（概率），博丽神社、迷途竹林、魔法森林、地灵殿、太阳花田蘑菇处采集；香霖堂处（概率）、魔法森林上海人形处、神灵庙道士处购买" },
    { "名称": "松露", "类别": "蔬菜", "特性": "素、高级、传说、鲜、山珍、菌类", "": "", "获取方式（仅采集和购买）": "妖怪兽道、红魔馆露水处（概率），博丽神社、迷途竹林、地灵殿蘑菇处（概率）采集；博丽神社妖精女仆处、魔法森林上海人形处、神灵庙道士处、辉针城不良少年处购买" },
    { "名称": "竹笋", "类别": "蔬菜", "特性": "素、清淡", "": "", "获取方式（仅采集和购买）": "迷途竹林、辉针城竹笋处、竹子处（概率）采集，香霖堂、妖怪兽道商人处（概率）、旧地狱鬼商处购买" },
    { "名称": "鸡蛋", "类别": "其他", "特性": "生", "": "", "获取方式（仅采集和购买）": "人间之里、旧地狱鸡窝处采集，妖怪兽道商人处、人间之里农户处、香霖堂处（概率）、魔法森林上海人形处购买" },
    { "名称": "桃子", "类别": "其他", "特性": "甜、果味", "": "", "获取方式（仅采集和购买）": "博丽神社、魔法森林、太阳花田桃树处采集，香霖堂处（概率）购买" },
    { "名称": "白果", "类别": "其他", "特性": "适合拍照", "": "", "获取方式（仅采集和购买）": "人间之里、博丽神社、魔法森林、太阳花田银杏处，妖怪之山蜂巢处，地灵殿花丛处采集；魔法森林上海人形处、地灵殿地狱鸦处购买" },
    { "名称": "蜂蜜", "类别": "其他", "特性": "甜", "": "", "获取方式（仅采集和购买）": "妖怪兽道、妖怪之山、命莲寺、太阳花田蜂巢处，人间之里、博丽神社银杏处（概率）采集；香霖堂处（概率）、魔法森林上海人形处、命莲寺娜兹玲处、太阳花田太阳花精处购买" },
    { "名称": "蝉蜕", "类别": "其他", "特性": "猎奇", "": "", "获取方式（仅采集和购买）": "妖怪兽道蜂巢处、博丽神社参道西侧、旧地狱银杏处采集" },
    { "名称": "幻昙华", "类别": "其他", "特性": "高级、传说、梦幻、不可思议", "": "", "获取方式（仅采集和购买）": "妖怪兽道东侧山丘（需借道博丽神社）、地灵殿东侧喷泉、地灵殿西北侧游乐场处（概率）、命莲寺西南花丛处采集" },
    { "名称": "露水", "类别": "其他", "特性": "清淡", "": "", "获取方式（仅采集和购买）": "妖怪兽道露水处、红魔馆露水处、魔法森林露水处、神灵庙露水处、太阳花田露水处采集，神灵庙道士处、太阳花田太阳花精处购买" },
    { "名称": "黄油", "类别": "其他", "特性": "重油", "": "", "获取方式（仅采集和购买）": "红魔馆地精处、地灵殿地狱鸦处购买" },
    { "名称": "面粉", "类别": "其他", "特性": "饱腹", "": "", "获取方式（仅采集和购买）": "红魔馆地精处、魔法森林上海人形处购买" },
    { "名称": "糯米", "类别": "其他", "特性": "－", "": "", "获取方式（仅采集和购买）": "迷途竹林妖怪兔处、香霖堂处（概率）、魔法森林上海人形处购买" },
    { "名称": "竹子", "类别": "其他", "特性": "适合拍照", "": "", "获取方式（仅采集和购买）": "迷途竹林、辉针城竹子处、香霖堂处（概率）购买" },
    { "名称": "月光草", "类别": "其他", "特性": "清淡、梦幻、不可思议、文化底蕴", "": "", "获取方式（仅采集和购买）": "妖怪兽道南侧亭子月光草处采集（需借道迷途竹林），迷途竹林妖怪兔处（概率）、地灵殿地狱鸦处购买" },
    { "名称": "冰块", "类别": "其他", "特性": "凉爽", "": "", "获取方式（仅采集和购买）": "红魔馆河流处，神灵庙北部冰块处采集，香霖堂处（概率）购买" },
    { "名称": "辣椒", "类别": "其他", "特性": "辣", "": "", "获取方式（仅采集和购买）": "妖怪兽道花丛处（概率）采集，妖怪兽道商人处（概率）、人间之里农户处、命莲寺娜兹玲处购买" },
    { "名称": "葡萄", "类别": "其他", "特性": "甜、果味", "": "", "获取方式（仅采集和购买）": "红魔馆、太阳花田葡萄处采集，魔法森林上海人形处（概率）、地灵殿地狱鸦处（概率）购买" },
    { "名称": "铃仙", "类别": "其他", "特性": "招牌、不可思议、适合拍照、特产", "": "", "获取方式（仅采集和购买）": "因幡帝商店处（概率）购买" },
    { "名称": "章鱼【DLC1】", "类别": "海鲜", "特性": "水产、鲜、海味", "": "", "获取方式（仅采集和购买）": "辉针城碗之后处（概率）采集，妖怪之山河童处（概率）购买" },
    { "名称": "海胆【DLC1】", "类别": "海鲜", "特性": "水产、高级、传说、鲜、海味", "": "", "获取方式（仅采集和购买）": "辉针城碗之后处采集，妖怪之山河童处（概率）、辉针城不良少年处（概率）购买" },
    { "名称": "螃蟹【DLC1】", "类别": "海鲜", "特性": "水产、高级、鲜", "": "", "获取方式（仅采集和购买）": "妖怪之山西北瀑布处、辉针城碗之后处（概率）采集，妖怪之山河童处（概率）、辉针城不良少年处（概率）购买" },
    { "名称": "黄瓜【DLC1】", "类别": "蔬菜", "特性": "素、家常、清淡", "": "", "获取方式（仅采集和购买）": "妖怪之山黄瓜处采集，妖怪之山河童处（概率）、太阳花田太阳花精处（概率）购买" },
    { "名称": "黑盐【DLC1】", "类别": "其他", "特性": "咸", "": "", "获取方式（仅采集和购买）": "妖怪之山黑盐处采集，妖怪之山河童处（概率）、命莲寺娜兹玲处购买" },
    { "名称": "奶油【DLC1】", "类别": "其他", "特性": "家常、甜、西式", "": "", "获取方式（仅采集和购买）": "魔法森林上海人形处（概率）、命莲寺娜兹玲处、太阳花田太阳花精处购买" },
    { "名称": "并蒂莲【DLC2】", "类别": "其他", "特性": "清淡、高级、传说、梦幻、文化底蕴", "": "", "获取方式（仅采集和购买）": "旧地狱、神灵庙桥头并蒂莲处、命莲寺东北并蒂莲处采集" },
    { "名称": "柠檬【DLC2】", "类别": "其他", "特性": "酸、果味", "": "", "获取方式（仅采集和购买）": "旧地狱桥头柠檬树处采集，地灵殿地狱鸦处购买" },
    { "名称": "芝士【DLC2】", "类别": "其他", "特性": "高级、咸、鲜", "": "", "获取方式（仅采集和购买）": "地灵殿东北侧仓库处采集，地灵殿地狱鸦处、命莲寺娜兹玲处购买" },
    { "名称": "板栗【DLC3】", "类别": "蔬菜", "特性": "素、家常", "": "", "获取方式（仅采集和购买）": "神灵庙中部栗树处采集，神灵庙道士处购买" },
    { "名称": "地瓜【DLC3】", "类别": "其他", "特性": "饱腹", "": "", "获取方式（仅采集和购买）": "命莲寺西北花丛处采集，命莲寺娜兹玲处购买" },
    { "名称": "莲子【DLC3】", "类别": "其他", "特性": "招牌、清淡、文化底蕴", "": "", "获取方式（仅采集和购买）": "命莲寺东北并蒂莲处、神灵庙东侧并蒂莲处采集" },
    { "名称": "松子【DLC3】", "类别": "其他", "特性": "招牌、清淡、高级", "": "", "获取方式（仅采集和购买）": "神灵庙中部松树处采集，神灵庙道士处购买" },
    { "名称": "香椿【DLC4】", "类别": "蔬菜", "特性": "素、毒", "": "", "获取方式（仅采集和购买）": "太阳花田西北香椿树处采集，太阳花田太阳花精处购买" },
    { "名称": "西红柿【DLC4】", "类别": "蔬菜", "特性": "素", "": "", "获取方式（仅采集和购买）": "太阳花田中部温室处采集" },
    { "名称": "梅子【DLC4】", "类别": "其他", "特性": "小巧、咸", "": "", "获取方式（仅采集和购买）": "辉针城东部红豆树处（概率）采集，辉针城不良少年处购买" },
    { "名称": "红豆【DLC4】", "类别": "其他", "特性": "家常", "": "", "获取方式（仅采集和购买）": "辉针城东部红豆树处采集，辉针城不良少年处购买" },
    { "名称": "鲜花【DLC4】", "类别": "其他", "特性": "梦幻、适合拍照", "": "", "获取方式（仅采集和购买）": "太阳花田西部、中部鲜花处采集" },
]

var 酒水 = [
    { "名称": "绿茶", "价格": "1", "特性": "无酒精", "等级": "1", "获取方式（仅采集和购买）": "初始拥有" },
    { "名称": "牛奶", "价格": "16", "特性": "无酒精、直饮", "等级": "2", "获取方式（仅采集和购买）": "人间之里清兰屋处购买" },
    { "名称": "红柚果汁", "价格": "24", "特性": "无酒精、水果", "等级": "2", "获取方式（仅采集和购买）": "人间之里清兰屋处购买" },
    { "名称": "红魔馆红茶", "价格": "25", "特性": "无酒精、可加热、水果、提神", "等级": "2", "获取方式（仅采集和购买）": "红魔馆小恶魔处购买" },
    { "名称": "波子汽水", "价格": "30", "特性": "无酒精、现代、气泡", "等级": "2", "获取方式（仅采集和购买）": "人间之里铃瑚屋处购买" },
    { "名称": "“大冰棍儿！”", "价格": "35", "特性": "无酒精、现代、提神、甘", "等级": "2", "获取方式（仅采集和购买）": "妖怪兽道三妖精处购买" },
    { "名称": "阿芙加朵", "价格": "35", "特性": "无酒精、可加冰、提神、甘、苦", "等级": "2", "获取方式（仅采集和购买）": "红魔馆小恶魔处购买" },
    { "名称": "冰山毛玉冻柠", "价格": "45", "特性": "无酒精、可加冰、气泡、水果、提神、直饮、甘", "等级": "2", "获取方式（仅采集和购买）": "妖怪兽道萌澄果处购买" },
    { "名称": "月面火箭", "价格": "45", "特性": "无酒精、可加冰、现代、气泡", "等级": "2", "获取方式（仅采集和购买）": "迷途竹林西侧泉水处、地灵殿西北侧游乐场处（概率）采集" },
    { "名称": "玉露茶", "价格": "50", "特性": "无酒精、可加热、古典", "等级": "2", "获取方式（仅采集和购买）": "地灵殿西南侧酒水架处采集，博丽神社河童处（概率）购买" },
    { "名称": "果味High Ball", "价格": "12", "特性": "低酒精、可加冰、西洋酒、鸡尾酒、水果、甘、苦", "等级": "1", "获取方式（仅采集和购买）": "妖怪兽道商人处购买" },
    { "名称": "果味SOUR", "价格": "12", "特性": "低酒精、可加冰、烧酒、鸡尾酒、水果、甘、苦", "等级": "1", "获取方式（仅采集和购买）": "妖怪兽道商人处购买" },
    { "名称": "淇", "价格": "18", "特性": "低酒精、可加冰、清酒、鸡尾酒、气泡、甘、苦、辛", "等级": "1", "获取方式（仅采集和购买）": "妖怪兽道商人处、人间之里酒屋处购买" },
    { "名称": "超ZUN啤酒", "价格": "18", "特性": "低酒精、可加冰、啤酒、苦", "等级": "1", "获取方式（仅采集和购买）": "人间之里酒屋处购买" },
    { "名称": "猩红恶魔", "价格": "45", "特性": "低酒精、可加冰、西洋酒、鸡尾酒", "等级": "2", "获取方式（仅采集和购买）": "博丽神社妖精女仆处购买" },
    { "名称": "冬酿", "价格": "60", "特性": "低酒精、可加冰、可加热、古典、甘", "等级": "2", "获取方式（仅采集和购买）": "香霖堂处（概率）、迷途竹林妖怪兔处、旧地狱鬼商处、神灵庙道士处、太阳花田太阳花精处购买" },
    { "名称": "梅酒", "价格": "32", "特性": "中酒精、可加冰、可加热、利口酒、水果", "等级": "2", "获取方式（仅采集和购买）": "人间之里酒屋处购买" },
    { "名称": "日月星", "价格": "34", "特性": "中酒精、可加冰、可加热、清酒、直饮", "等级": "2", "获取方式（仅采集和购买）": "人间之里酒屋处购买" },
    { "名称": "神之麦", "价格": "45", "特性": "中酒精、可加冰、可加热、烧酒、直饮", "等级": "2", "获取方式（仅采集和购买）": "博丽神社河童处、神灵庙道士处购买" },
    { "名称": "雀酒", "价格": "50", "特性": "中酒精、可加冰、可加热、清酒、辛", "等级": "2", "获取方式（仅采集和购买）": "妖怪兽道东南侧路灯附近、太阳花田南侧银杏树附近采集" },
    { "名称": "红雾", "价格": "75", "特性": "中酒精、可加热、西洋酒", "等级": "2", "获取方式（仅采集和购买）": "红魔馆小恶魔处、辉针城不良少年处购买" },
    { "名称": "尼格罗尼", "价格": "100", "特性": "中酒精、可加冰、西洋酒、鸡尾酒、水果、苦", "等级": "3", "获取方式（仅采集和购买）": "地灵殿西南侧酒水架处、太阳花田东侧向日葵处、辉针城东侧酒窖处（概率）采集，红魔馆妖精女仆处购买" },
    { "名称": "水獭祭", "价格": "130", "特性": "中酒精、可加冰、可加热、清酒、直饮", "等级": "3", "获取方式（仅采集和购买）": "妖怪兽道南侧码头附近、太阳花田东侧向日葵处、辉针城东侧酒窖处（概率）采集，命莲寺娜兹玲处购买" },
    { "名称": "风祝", "价格": "130", "特性": "中酒精、可加冰、鸡尾酒、现代、甘", "等级": "3", "获取方式（仅采集和购买）": "博丽神社西侧守矢分社处（概率）祈愿，太阳花田东侧向日葵处、辉针城东侧酒窖处（概率）采集，太阳花田太阳花精处购买" },
    { "名称": "十四夜", "价格": "440", "特性": "中酒精、可加冰、可加热、清酒、古典、甘", "等级": "4", "获取方式（仅采集和购买）": "辉针城东侧酒窖处（概率）采集，迷途竹林妖怪兔处购买" },
    { "名称": "天狗踊", "价格": "70", "特性": "高酒精、可加冰、可加热、清酒、直饮", "等级": "2", "获取方式（仅采集和购买）": "博丽神社河童处、旧地狱鬼商处购买" },
    { "名称": "教父", "价格": "180", "特性": "高酒精、可加冰、西洋酒、鸡尾酒、古典、苦", "等级": "3", "获取方式（仅采集和购买）": "地灵殿西南侧酒水架处、辉针城东侧酒窖处（概率）采集，红魔馆妖精女仆处、辉针城不良少年处购买" },
    { "名称": "晓", "价格": "400", "特性": "高酒精、可加冰、西洋酒、直饮", "等级": "4", "获取方式（仅采集和购买）": "地灵殿西南侧酒水架处、辉针城东侧酒窖处（概率）采集，博丽神社妖精女仆处（概率）购买" },
    { "名称": "火鼠裘", "价格": "420", "特性": "高酒精、可加热、烧酒、辛", "等级": "4", "获取方式（仅采集和购买）": "辉针城东侧酒窖处（概率）采集，旧地狱鬼商处购买" },
    { "名称": "【DLC1】古法奶油冰沙", "价格": "42", "特性": "无酒精、可加冰、古典、甘", "等级": "1", "获取方式（仅采集和购买）": "魔法森林上海人形处购买" },
    { "名称": "【DLC1】咖啡", "价格": "62", "特性": "无酒精、可加冰、可加热、现代、提神、苦", "等级": "2", "获取方式（仅采集和购买）": "魔法森林上海人形处购买" },
    { "名称": "【DLC1】妖精雨露", "价格": "80", "特性": "无酒精、可加冰、甘", "等级": "2", "获取方式（仅采集和购买）": "魔法森林中部树根处采集" },
    { "名称": "【DLC1】普通健身茶", "价格": "32", "特性": "中酒精、利口酒、气泡、苦", "等级": "2", "获取方式（仅采集和购买）": "魔法森林上海人形处购买" },
    { "名称": "【DLC1】大吟酿", "价格": "210", "特性": "中酒精、可加冰、清酒、古典、水果、直饮、甘", "等级": "3", "获取方式（仅采集和购买）": "妖怪之山河童处（概率）购买" },
    { "名称": "【DLC2】古明地冰激凌", "价格": "35", "特性": "无酒精、现代、水果、甘", "等级": "2", "获取方式（仅采集和购买）": "地灵殿地狱鸦处购买" },
    { "名称": "【DLC2】气保健", "价格": "45", "特性": "无酒精、提神、直饮、甘", "等级": "2", "获取方式（仅采集和购买）": "地灵殿地狱鸦处购买" },
    { "名称": "【DLC2】鬼杀", "价格": "320", "特性": "高酒精、可加冰、烧酒、古典、辛", "等级": "4", "获取方式（仅采集和购买）": "旧地狱鬼商处购买" },
    { "名称": "【DLC3】杨枝甘露", "价格": "50", "特性": "无酒精、可加冰、水果", "等级": "2", "获取方式（仅采集和购买）": "命莲寺娜兹玲处购买" },
    { "名称": "【DLC3】麒麟", "价格": "180", "特性": "中酒精、啤酒、直饮", "等级": "3", "获取方式（仅采集和购买）": "神灵庙道士处购买" },
    { "名称": "【DLC4】伶人醉", "价格": "100", "特性": "低酒精、古典、水果、直饮、甘", "等级": "3", "获取方式（仅采集和购买）": "辉针城东侧酒窖处采集，太阳花田太阳花精处购买" },
    { "名称": "【DLC4】天地无用", "价格": "150", "特性": "高酒精、烧酒", "等级": "3", "获取方式（仅采集和购买）": "辉针城东侧酒窖处采集，辉针城不良少年处购买" },
]

var 稀客 = [
    { "名称": "莉格露", "携带金额": "200－400", "喜好·料理": "肉、甜、生、猎奇", "喜好·酒水": "低酒精、可加冰", "厌恶·料理": "素、清淡、凉爽", "出没地点（非邀请状态下三级店）": "妖怪兽道、魔法森林、太阳花田" },
    { "名称": "橙", "携带金额": "400－600", "喜好·料理": "肉、水产、重油、甜、烧烤、流行·喜爱", "喜好·酒水": "水果、辛", "厌恶·料理": "素、猎奇、灼热、流行·厌恶", "出没地点（非邀请状态下三级店）": "妖怪兽道" },
    { "名称": "露米娅", "携带金额": "150－350", "喜好·料理": "招牌、肉、饱腹、生、猎奇、流行·喜爱", "喜好·酒水": "气泡、苦", "厌恶·料理": "昂贵、下酒、流行·厌恶", "出没地点（非邀请状态下三级店）": "妖怪兽道、魔法森林" },
    { "名称": "稗田阿求", "携带金额": "500－800", "喜好·料理": "清淡、高级、甜、文化底蕴、汤羹、和风、流行·喜爱", "喜好·酒水": "可加热、清酒", "厌恶·料理": "重油、咸、灼热、流行·厌恶", "出没地点（非邀请状态下三级店）": "人间之里、命莲寺" },
    { "名称": "茨木华扇", "携带金额": "400－600", "喜好·料理": "家常、下酒、文化底蕴、和风", "喜好·酒水": "中酒精、古典、直饮", "厌恶·料理": "实惠、辣、生", "出没地点（非邀请状态下三级店）": "人间之里、旧地狱、神灵庙" },
    { "名称": "上白泽慧音", "携带金额": "400－800", "喜好·料理": "家常、素、清淡、文化底蕴、和风、中华、流行·喜爱", "喜好·酒水": "清酒、烧酒、利口酒", "厌恶·料理": "重油、大份、咸、流行·厌恶", "出没地点（非邀请状态下三级店）": "人间之里、魔法森林、命莲寺" },
    { "名称": "森近霖之助", "携带金额": "250－400", "喜好·料理": "家常、饱腹、鲜、流行·喜爱", "喜好·酒水": "啤酒、烧酒", "厌恶·料理": "下酒、重油、猎奇、流行·厌恶", "出没地点（非邀请状态下三级店）": "人间之里、魔法森林、太阳花田" },
    { "名称": "魂魄妖梦（剧情）", "携带金额": "－", "喜好·料理": "传说、和风", "喜好·酒水": "直饮", "厌恶·料理": "－", "出没地点（非邀请状态下三级店）": "人间之里" },
    { "名称": "伊吹萃香", "携带金额": "600－800", "喜好·料理": "肉、下酒、小巧、力量涌现、和风、流行·喜爱", "喜好·酒水": "高酒精、直饮", "厌恶·料理": "重油、流行·厌恶", "出没地点（非邀请状态下三级店）": "博丽神社、妖怪之山、辉针城" },
    { "名称": "比那名居天子", "携带金额": "2000－3000", "喜好·料理": "昂贵、素、清淡、传说、甜、果味、适合拍照、流行·厌恶", "喜好·酒水": "高酒精、鸡尾酒", "厌恶·料理": "家常、肉、重油、流行·喜爱", "出没地点（非邀请状态下三级店）": "博丽神社、妖怪之山、旧地狱、神灵庙、太阳花田" },
    { "名称": "博丽灵梦", "携带金额": "150－300", "喜好·料理": "实惠、饱腹、高级、甜、不可思议、流行·喜爱", "喜好·酒水": "无酒精、低酒精、可加热", "厌恶·料理": "昂贵、下酒、流行·厌恶", "出没地点（非邀请状态下三级店）": "博丽神社、妖怪兽道、人间之里、魔法森林、妖怪之山" },
    { "名称": "琪露诺", "携带金额": "100－200", "喜好·料理": "甜、凉爽、猎奇、适合拍照、流行·厌恶", "喜好·酒水": "可加冰、水果、甘", "厌恶·料理": "昂贵、下酒、文化底蕴、流行·喜爱", "出没地点（非邀请状态下三级店）": "红魔馆、妖怪之山" },
    { "名称": "红美铃", "携带金额": "200－400", "喜好·料理": "肉、饱腹、力量涌现、中华、流行·喜爱", "喜好·酒水": "可加热、古典、提神", "厌恶·料理": "果味、猎奇、西式、流行·厌恶", "出没地点（非邀请状态下三级店）": "红魔馆" },
    { "名称": "帕秋莉", "携带金额": "600－1000", "喜好·料理": "高级、甜、梦幻、适合拍照、西式", "喜好·酒水": "利口酒、鸡尾酒、气泡", "厌恶·料理": "咸、生、猎奇、灼热", "出没地点（非邀请状态下三级店）": "红魔馆、魔法森林、地灵殿" },
    { "名称": "蕾米莉亚（剧情）", "携带金额": "－", "喜好·料理": "高级、甜、生、西式", "喜好·酒水": "西洋酒、古典、水果、甘", "厌恶·料理": "－", "出没地点（非邀请状态下三级店）": "红魔馆" },
    { "名称": "藤原妹红", "携带金额": "300－600", "喜好·料理": "辣、果味、灼热、燃起来了、烧烤", "喜好·酒水": "烧酒、苦、辛", "厌恶·料理": "昂贵、高级、不可思议", "出没地点（非邀请状态下三级店）": "迷途竹林、妖怪兽道" },
    { "名称": "因幡帝", "携带金额": "200－400", "喜好·料理": "小巧、传说、甜、凉爽、梦幻、流行·喜爱", "喜好·酒水": "无酒精、水果、甘", "厌恶·料理": "重油、山珍、猎奇、流行·厌恶", "出没地点（非邀请状态下三级店）": "迷途竹林" },
    { "名称": "蓬莱山辉夜", "携带金额": "1000－1500", "喜好·料理": "传说、不可思议、文化底蕴、和风、流行·喜爱", "喜好·酒水": "清酒、古典、现代", "厌恶·料理": "招牌、大份、猎奇、流行·厌恶", "出没地点（非邀请状态下三级店）": "迷途竹林、辉针城" },
    { "名称": "魂魄妖梦", "携带金额": "300－400", "喜好·料理": "家常、清淡、鲜、力量涌现", "喜好·酒水": "无酒精、可加热、水果", "厌恶·料理": "重油、猎奇、咸", "出没地点（非邀请状态下三级店）": "妖怪兽道、人间之里、博丽神社、迷途竹林" },
    { "名称": "西行寺幽幽子", "携带金额": "1500－2000", "喜好·料理": "肉、水产、饱腹、大份、高级、传说、和风、中华", "喜好·酒水": "高酒精、可加冰、鸡尾酒", "厌恶·料理": "素、清淡、小巧", "出没地点（非邀请状态下三级店）": "博丽神社、红魔馆、迷途竹林、神灵庙" },
    { "名称": "冴月麟", "携带金额": "400－600", "喜好·料理": "家常、水产、辣、中华、流行·喜爱", "喜好·酒水": "无酒精、气泡、甘", "厌恶·料理": "下酒、重油、生", "出没地点（非邀请状态下三级店）": "妖怪兽道、人间之里、博丽神社、红魔馆、迷途竹林" },
    { "名称": "立空汐", "携带金额": "500－800", "喜好·料理": "昂贵、肉、下酒、山珍、力量涌现、和风、流行·厌恶", "喜好·酒水": "高酒精、可加冰、可加热", "厌恶·料理": "素、清淡、流行·喜爱", "出没地点（非邀请状态下三级店）": "妖怪兽道、博丽神社、红魔馆、迷途竹林、妖怪之山" },
    { "名称": "时焉侑", "携带金额": "1300－1800", "喜好·料理": "下酒、传说、文化底蕴、特产、西式、中华", "喜好·酒水": "中酒精、可加冰、西洋酒、鸡尾酒", "厌恶·料理": "水产、饱腹、重油", "出没地点（非邀请状态下三级店）": "人间之里、博丽神社" },
    { "名称": "蹦蹦跳跳的三妖精", "携带金额": "300－400", "喜好·料理": "家常、小巧、甜、凉爽、梦幻、菌类、流行·喜爱", "喜好·酒水": "无酒精、水果、甘、苦", "厌恶·料理": "生、猎奇、灼热、流行·厌恶", "出没地点（非邀请状态下三级店）": "妖怪兽道、人间之里、博丽神社、红魔馆、迷途竹林、妖怪之山" },
    { "名称": "萌澄果", "携带金额": "1200－1600", "喜好·料理": "肉、水产、甜、梦幻、流行·喜爱", "喜好·酒水": "可加冰、水果、甘、辛", "厌恶·料理": "猎奇、灼热、流行·厌恶", "出没地点（非邀请状态下三级店）": "妖怪兽道、人间之里、博丽神社、红魔馆、迷途竹林、魔法森林、妖怪之山、命莲寺、神灵庙、太阳花田、辉针城" },
    { "名称": "雾雨魔理沙", "携带金额": "3000－5000", "喜好·料理": "重油、传说、灼热、菌类、和风、流行·喜爱", "喜好·酒水": "低酒精、可加冰", "厌恶·料理": "猎奇、流行·厌恶", "出没地点（非邀请状态下三级店）": "魔法森林、妖怪兽道、人间之里、博丽神社、红魔馆、迷途竹林、妖怪之山、旧地狱、地灵殿、命莲寺、神灵庙、太阳花田、辉针城" },
    { "名称": "【DLC1】爱丽丝", "携带金额": "500－800", "喜好·料理": "家常、高级、甜、文化底蕴、西式", "喜好·酒水": "低酒精、西洋酒、现代", "厌恶·料理": "肉、饱腹、重油、猎奇", "出没地点（非邀请状态下三级店）": "魔法森林、太阳花田" },
    { "名称": "【DLC1】矢田寺成美", "携带金额": "300－600", "喜好·料理": "清淡、山珍、文化底蕴、特产、和风", "喜好·酒水": "低酒精、中酒精、可加冰、古典、直饮", "厌恶·料理": "饱腹、重油", "出没地点（非邀请状态下三级店）": "魔法森林、命莲寺" },
    { "名称": "【DLC1】犬走椛", "携带金额": "300－400", "喜好·料理": "肉、下酒、重油、大份、山珍", "喜好·酒水": "中酒精、高酒精、直饮", "厌恶·料理": "素、清淡、猎奇", "出没地点（非邀请状态下三级店）": "妖怪之山" },
    { "名称": "【DLC1】河城荷取", "携带金额": "400－500", "喜好·料理": "招牌、水产、下酒、高级、咸、猎奇", "喜好·酒水": "中酒精、高酒精、清酒、直饮", "厌恶·料理": "素、山珍、文化底蕴", "出没地点（非邀请状态下三级店）": "妖怪之山" },
    { "名称": "【DLC1】东风谷早苗", "携带金额": "400－600", "喜好·料理": "家常、甜、梦幻、适合拍照、和风、流行·喜爱", "喜好·酒水": "无酒精、低酒精、清酒、现代、气泡、水果、直饮、甘、苦", "厌恶·料理": "重油、生、猎奇、灼热", "出没地点（非邀请状态下三级店）": "妖怪之山、魔法森林、命莲寺、神灵庙" },
    { "名称": "【DLC1】饕餮尤魔", "携带金额": "9999－9999", "喜好·料理": "肉、饱腹、大份、高级、传说、鲜、生、不可思议、力量涌现", "喜好·酒水": "高酒精、烧酒、直饮、辛", "厌恶·料理": "－", "出没地点（非邀请状态下三级店）": "妖怪之山、妖怪兽道、博丽神社、红魔馆、迷途竹林、魔法森林、旧地狱、地灵殿、命莲寺、神灵庙、太阳花田、辉针城" },
    { "名称": "【DLC2】黑谷山女", "携带金额": "250－400", "喜好·料理": "甜、鲜、生、猎奇、适合拍照、流行·喜爱", "喜好·酒水": "低酒精、中酒精、啤酒、甘", "厌恶·料理": "重油、咸、灼热", "出没地点（非邀请状态下三级店）": "旧地狱、妖怪兽道、红魔馆、魔法森林、妖怪之山" },
    { "名称": "【DLC2】水桥帕露西", "携带金额": "300－400", "喜好·料理": "肉、酸、辣、咸、鲜、果味、流行·厌恶", "喜好·酒水": "无酒精、可加热、直饮、苦、辛", "厌恶·料理": "甜、流行·喜爱", "出没地点（非邀请状态下三级店）": "旧地狱" },
    { "名称": "【DLC2】星熊勇仪", "携带金额": "600－1000", "喜好·料理": "招牌、下酒、大份、传说、力量涌现、燃起来了、和风、流行·喜爱", "喜好·酒水": "高酒精、啤酒、清酒、古典", "厌恶·料理": "素、小巧、猎奇", "出没地点（非邀请状态下三级店）": "旧地狱、博丽神社、妖怪之山、地灵殿" },
    { "名称": "【DLC2】火焰猫燐", "携带金额": "500－700", "喜好·料理": "水产、甜、鲜、海味、梦幻、猎奇、流行·喜爱", "喜好·酒水": "低酒精、清酒、水果", "厌恶·料理": "生、灼热", "出没地点（非邀请状态下三级店）": "地灵殿、人间之里、博丽神社、妖怪之山、旧地狱、命莲寺、神灵庙" },
    { "名称": "【DLC2】古明地觉", "携带金额": "500－600", "喜好·料理": "家常、小巧、甜、梦幻、力量涌现、特产", "喜好·酒水": "无酒精、气泡、提神、苦", "厌恶·料理": "肉、大份、山珍、猎奇、灼热", "出没地点（非邀请状态下三级店）": "地灵殿、人间之里、博丽神社、红魔馆、迷途竹林、魔法森林" },
    { "名称": "【DLC2】灵乌路空", "携带金额": "500－800", "喜好·料理": "肉、重油、辣、咸、灼热、力量涌现", "喜好·酒水": "中酒精、可加热、鸡尾酒", "厌恶·料理": "清淡、菌类", "出没地点（非邀请状态下三级店）": "地灵殿、妖怪之山" },
    { "名称": "【DLC2】古明地恋", "携带金额": "800－1200", "喜好·料理": "甜、咸、生、梦幻、猎奇、不可思议、流行·厌恶", "喜好·酒水": "高酒精、烧酒、气泡、苦", "厌恶·料理": "－", "出没地点（非邀请状态下三级店）": "地灵殿、妖怪兽道、人间之里、博丽神社、红魔馆、迷途竹林、魔法森林、妖怪之山、旧地狱、命莲寺、神灵庙、太阳花田、辉针城" },
    { "名称": "【DLC3】多多良小伞", "携带金额": "150－300", "喜好·料理": "家常、饱腹、甜、猎奇、不可思议、力量涌现、适合拍照、流行·喜爱", "喜好·酒水": "中酒精、可加冰、古典、水果", "厌恶·料理": "辣、灼热、汤羹", "出没地点（非邀请状态下三级店）": "命莲寺、辉针城" },
    { "名称": "【DLC3】封兽鵺", "携带金额": "300－500", "喜好·料理": "招牌、肉、鲜、生、猎奇、不可思议、适合拍照、特产、流行·厌恶", "喜好·酒水": "可加热、烧酒、古典、直饮", "厌恶·料理": "酸、西式、流行·喜爱", "出没地点（非邀请状态下三级店）": "命莲寺、辉针城" },
    { "名称": "【DLC3】村纱水蜜", "携带金额": "400－600", "喜好·料理": "肉、饱腹、高级、咸、鲜、力量涌现、特产", "喜好·酒水": "高酒精、可加冰、西洋酒、辛", "厌恶·料理": "素、小巧、酸、猎奇", "出没地点（非邀请状态下三级店）": "命莲寺" },
    { "名称": "【DLC3】苏我屠自古", "携带金额": "500－600", "喜好·料理": "招牌、家常、饱腹、重油、力量涌现、烧烤、和风", "喜好·酒水": "高酒精、啤酒、烧酒、苦", "厌恶·料理": "甜、凉爽", "出没地点（非邀请状态下三级店）": "神灵庙" },
    { "名称": "【DLC3】物部布都", "携带金额": "600－900", "喜好·料理": "清淡、高级、传说、山珍、燃起来了、和风、流行·喜爱", "喜好·酒水": "中酒精、可加热、气泡、直饮", "厌恶·料理": "生、西式、流行·厌恶", "出没地点（非邀请状态下三级店）": "神灵庙" },
    { "名称": "【DLC3】霍青娥", "携带金额": "400－900", "喜好·料理": "素、小巧、传说、甜、不可思议、特产、中华、流行·喜爱", "喜好·酒水": "低酒精、清酒、现代、水果", "厌恶·料理": "饱腹、重油", "出没地点（非邀请状态下三级店）": "神灵庙" },
    { "名称": "【DLC3】二岩猯藏", "携带金额": "1000－1200", "喜好·料理": "家常、肉、水产、下酒、传说、果味、和风、流行·喜爱", "喜好·酒水": "高酒精、可加热、烧酒、古典", "厌恶·料理": "辣、灼热", "出没地点（非邀请状态下三级店）": "妖怪兽道、人间之里、博丽神社、命莲寺、神灵庙" },
    { "名称": "【DLC4】梅蒂欣", "携带金额": "200－400", "喜好·料理": "招牌、小巧、甜、毒、凉爽、梦幻、适合拍照、菌类", "喜好·酒水": "无酒精、水果、甘、苦", "厌恶·料理": "文化底蕴", "出没地点（非邀请状态下三级店）": "太阳花田" },
    { "名称": "【DLC4】射命丸文", "携带金额": "500－600", "喜好·料理": "招牌、家常、肉、下酒、适合拍照、和风、流行·喜爱", "喜好·酒水": "高酒精、可加冰、烧酒、提神", "厌恶·料理": "西式、流行·厌恶", "出没地点（非邀请状态下三级店）": "太阳花田、妖怪兽道、人间之里、博丽神社、红魔馆、迷途竹林、魔法森林、妖怪之山、旧地狱、地灵殿、命莲寺、神灵庙、辉针城" },
    { "名称": "【DLC4】风见幽香", "携带金额": "1200－1800", "喜好·料理": "清淡、高级、传说、梦幻、不可思议、特产、西式、流行·喜爱", "喜好·酒水": "利口酒、西洋酒、鸡尾酒、现代", "厌恶·料理": "饱腹、咸、灼热、和风", "出没地点（非邀请状态下三级店）": "太阳花田" },
    { "名称": "【DLC4】少名针妙丸", "携带金额": "600－1200", "喜好·料理": "小巧、传说、甜、燃起来了、适合拍照、文化底蕴、和风、流行·喜爱", "喜好·酒水": "低酒精、可加热、古典、气泡", "厌恶·料理": "大份、西式", "出没地点（非邀请状态下三级店）": "辉针城" },
    { "名称": "【DLC4】今泉影狼", "携带金额": "300－600", "喜好·料理": "家常、肉、山珍、凉爽、适合拍照、和风、流行·喜爱", "喜好·酒水": "中酒精、可加冰、清酒、直饮", "厌恶·料理": "灼热", "出没地点（非邀请状态下三级店）": "辉针城、迷途竹林" },
    { "名称": "【DLC4】鬼人正邪", "携带金额": "300－600", "喜好·料理": "下酒、重油、猎奇、灼热、不可思议、力量涌现、燃起来了、流行·厌恶", "喜好·酒水": "中酒精、烧酒、直饮、辛", "厌恶·料理": "高级、流行·喜爱", "出没地点（非邀请状态下三级店）": "辉针城" },
    { "名称": "【DLC4】蕾米莉亚", "携带金额": "4950－5000", "喜好·料理": "高级、传说、甜、生、西式、流行·喜爱", "喜好·酒水": "高酒精、西洋酒、古典、水果、甘", "厌恶·料理": "实惠、酸、辣、咸", "出没地点（非邀请状态下三级店）": "博丽神社、红魔馆" },
    { "名称": "【DLC4】芙兰朵露", "携带金额": "－", "喜好·料理": "－", "喜好·酒水": "－", "厌恶·料理": "－", "出没地点（非邀请状态下三级店）": "－" },
    { "名称": "【DLC4】若鹭姬", "携带金额": "－", "喜好·料理": "－", "喜好·酒水": "－", "厌恶·料理": "－", "出没地点（非邀请状态下三级店）": "－" },
    { "名称": "【DLC2.5】摩多罗隐岐奈", "携带金额": "－", "喜好·料理": "－", "喜好·酒水": "－", "厌恶·料理": "－", "出没地点（非邀请状态下三级店）": "－" },

]

var 普客 = [
    { "名称": "妖怪兔", "喜好·料理": "招牌、家常、甜、咸、鲜、果味、凉爽、力量涌现、流行·喜爱", "喜好·酒水": "无酒精", "出没地点": "妖怪兽道、红魔馆、迷途竹林、魔法森林、妖怪之山、地灵殿" },
    { "名称": "妖怪猫", "喜好·料理": "招牌、肉、海味、凉爽、中华、流行·喜爱", "喜好·酒水": "可加冰、啤酒、苦", "出没地点": "妖怪兽道、博丽神社、红魔馆、迷途竹林、魔法森林、妖怪之山、地灵殿" },
    { "名称": "妖怪狸", "喜好·料理": "招牌、肉、饱腹、重油、咸、山珍、流行·喜爱", "喜好·酒水": "甘、辛", "出没地点": "妖怪兽道、博丽神社、红魔馆、迷途竹林、魔法森林、妖怪之山、命莲寺" },
    { "名称": "妖怪狐", "喜好·料理": "招牌、肉、小巧、和风、中华、流行·喜爱", "喜好·酒水": "直饮", "出没地点": "妖怪兽道、红魔馆、迷途竹林、妖怪之山、旧地狱" },
    { "名称": "蟒蛇精", "喜好·料理": "肉、下酒、山珍、力量涌现、流行·喜爱", "喜好·酒水": "清酒、烧酒", "出没地点": "妖怪兽道、妖怪之山、旧地狱" },
    { "名称": "人类小孩", "喜好·料理": "招牌、家常、肉、饱腹、甜、咸、凉爽、中华、流行·喜爱", "喜好·酒水": "无酒精", "出没地点": "人间之里" },
    { "名称": "人类男性", "喜好·料理": "肉、下酒、咸、鲜、灼热、文化底蕴、和风、流行·喜爱", "喜好·酒水": "可加热、烧酒", "出没地点": "人间之里、命莲寺、神灵庙" },
    { "名称": "人类女性", "喜好·料理": "招牌、水产、高级、咸、鲜、凉爽、流行·喜爱", "喜好·酒水": "可加冰", "出没地点": "人间之里、博丽神社、命莲寺、神灵庙" },
    { "名称": "人类长者", "喜好·料理": "招牌、高级、灼热、适合拍照、流行·喜爱", "喜好·酒水": "低酒精", "出没地点": "人间之里、博丽神社、神灵庙" },
    { "名称": "左卫门", "喜好·料理": "高级、生、猎奇、力量涌现、流行·喜爱", "喜好·酒水": "高酒精", "出没地点": "人间之里、博丽神社" },
    { "名称": "座敷童子", "喜好·料理": "招牌、甜、生、山珍、凉爽、和风、流行·喜爱", "喜好·酒水": "无酒精、低酒精", "出没地点": "博丽神社" },
    { "名称": "河童", "喜好·料理": "招牌、大份、小巧、高级、海味、猎奇、灼热、流行·喜爱", "喜好·酒水": "甘", "出没地点": "博丽神社、红魔馆、魔法森林、妖怪之山" },
    { "名称": "鸦天狗", "喜好·料理": "招牌、高级、适合拍照、菌类、流行·喜爱", "喜好·酒水": "清酒、烧酒", "出没地点": "博丽神社、红魔馆、迷途竹林、妖怪之山" },
    { "名称": "妖精", "喜好·料理": "甜、鲜、果味、梦幻、适合拍照、菌类、特产、流行·喜爱", "喜好·酒水": "气泡、水果、直饮、甘", "出没地点": "红魔馆、迷途竹林、魔法森林" },
    { "名称": "地精", "喜好·料理": "重油、高级、山珍、凉爽、灼热、力量涌现、流行·喜爱", "喜好·酒水": "清酒、西洋酒", "出没地点": "爱丽丝奖励符卡召唤" },
    { "名称": "【DLC1】魔法使", "喜好·料理": "家常、素、清淡、高级、传说、鲜、凉爽、适合拍照、西式、流行·喜爱", "喜好·酒水": "可加热、西洋酒、鸡尾酒、提神", "出没地点": "魔法森林" },
    { "名称": "【DLC1】森之妖精", "喜好·料理": "招牌、家常、小巧、甜、鲜、凉爽、梦幻、和风、中华、流行·喜爱", "喜好·酒水": "无酒精、低酒精、清酒、水果、甘", "出没地点": "魔法森林" },
    { "名称": "【DLC1】谜之人形", "喜好·料理": "家常、小巧、咸、生、梦幻、猎奇、适合拍照、菌类、流行·喜爱", "喜好·酒水": "气泡、水果、提神、苦", "出没地点": "魔法森林" },
    { "名称": "【DLC1】山姥", "喜好·料理": "家常、肉、饱腹、高级、鲜、猎奇、力量涌现、流行·喜爱", "喜好·酒水": "高酒精、烧酒、古典、直饮", "出没地点": "妖怪之山" },
    { "名称": "【DLC1】山童", "喜好·料理": "招牌、大份、小巧、高级、山珍、猎奇、灼热、流行·喜爱", "喜好·酒水": "中酒精、苦", "出没地点": "妖怪之山" },
    { "名称": "【DLC1】白狼天狗", "喜好·料理": "招牌、肉、饱腹、重油、咸、鲜、生、山珍、特产、流行·喜爱", "喜好·酒水": "中酒精、高酒精、清酒、烧酒", "出没地点": "妖怪之山" },
    { "名称": "【DLC2】土蜘蛛", "喜好·料理": "肉、饱腹、重油、大份、甜、鲜、生、山珍、猎奇、流行·喜爱", "喜好·酒水": "中酒精、可加冰、利口酒、现代、直饮、甘、苦", "出没地点": "旧地狱" },
    { "名称": "【DLC2】鬼", "喜好·料理": "肉、下酒、高级、传说、鲜、力量涌现、燃起来了、特产、流行·喜爱", "喜好·酒水": "中酒精、高酒精、烧酒、直饮", "出没地点": "旧地狱" },
    { "名称": "【DLC2】骨女", "喜好·料理": "素、清淡、酸、鲜、生、凉爽、猎奇、菌类、流行·喜爱", "喜好·酒水": "低酒精、可加热、啤酒、水果、苦", "出没地点": "旧地狱" },
    { "名称": "【DLC2】地狱鸦", "喜好·料理": "家常、肉、小巧、酸、咸、山珍、海味、燃起来了、流行·喜爱", "喜好·酒水": "中酒精、可加热、啤酒、苦、辛", "出没地点": "地灵殿" },
    { "名称": "【DLC2】姑获鸟", "喜好·料理": "家常、水产、清淡、酸、鲜、猎奇、文化底蕴、流行·喜爱", "喜好·酒水": "低酒精、可加热、烧酒、苦", "出没地点": "地灵殿" },
    { "名称": "【DLC2】豹女", "喜好·料理": "肉、重油、高级、生、山珍、海味、灼热、特产、流行·喜爱", "喜好·酒水": "中酒精、高酒精、直饮、辛", "出没地点": "地灵殿" },
    { "名称": "【DLC3】僧侣", "喜好·料理": "家常、肉、下酒、山珍、力量涌现、流行·喜爱", "喜好·酒水": "中酒精、高酒精、可加热、烧酒、古典", "出没地点": "命莲寺" },
    { "名称": "【DLC3】妖怪鼠", "喜好·料理": "家常、大份、高级、果味、梦幻、流行·喜爱", "喜好·酒水": "利口酒、鸡尾酒、现代、水果、甘", "出没地点": "命莲寺" },
    { "名称": "【DLC3】八尺大人", "喜好·料理": "鲜、凉爽、适合拍照、和风、西式、流行·喜爱", "喜好·酒水": "低酒精、可加冰、利口酒、西洋酒、鸡尾酒", "出没地点": "命莲寺" },
    { "名称": "【DLC3】道士", "喜好·料理": "招牌、家常、清淡、小巧、山珍、特产、流行·喜爱", "喜好·酒水": "低酒精、现代、提神、苦", "出没地点": "神灵庙" },
    { "名称": "【DLC3】僵尸", "喜好·料理": "全部", "喜好·酒水": "全部", "出没地点": "神灵庙" },
    { "名称": "【DLC3】仙人", "喜好·料理": "素、清淡、小巧、高级、果味、梦幻、流行·喜爱", "喜好·酒水": "低酒精、清酒、古典、气泡、水果、甘", "出没地点": "神灵庙" },
    { "名称": "【DLC4】铃兰花精", "喜好·料理": "下酒、小巧、生、毒、梦幻、流行·喜爱", "喜好·酒水": "中酒精、气泡、直饮、辛", "出没地点": "太阳花田" },
    { "名称": "【DLC4】太阳花精", "喜好·料理": "甜、鲜、不可思议、力量涌现、特产、流行·喜爱", "喜好·酒水": "利口酒、气泡、水果、甘", "出没地点": "太阳花田" },
    { "名称": "【DLC4】玫瑰花精", "喜好·料理": "招牌、小巧、高级、适合拍照、西式、流行·喜爱", "喜好·酒水": "低酒精、鸡尾酒、现代、甘", "出没地点": "太阳花田" },
    { "名称": "【DLC4】影女", "喜好·料理": "家常、生、凉爽、猎奇、不可思议、和风、流行·喜爱", "喜好·酒水": "高酒精、可加冰、古典、提神、苦", "出没地点": "太阳花田" },
    { "名称": "【DLC4】小人族", "喜好·料理": "小巧、传说、梦幻、力量涌现、燃起来了、和风、流行·喜爱", "喜好·酒水": "可加冰、可加热、啤酒、古典、甘", "出没地点": "辉针城" },
    { "名称": "【DLC4】不良少年", "喜好·料理": "家常、饱腹、下酒、力量涌现、和风、流行·喜爱", "喜好·酒水": "高酒精、可加热、啤酒、烧酒、提神、苦", "出没地点": "辉针城" },
    { "名称": "【DLC4】不良少女", "喜好·料理": "家常、高级、灼热、适合拍照、和风、流行·喜爱", "喜好·酒水": "中酒精、啤酒、现代、气泡、水果", "出没地点": "辉针城" },
    { "名称": "【DLC4】玩具兵", "喜好·料理": "招牌、海味、凉爽、不可思议、西式、流行·喜爱", "喜好·酒水": "利口酒、西洋酒、现代、直饮", "出没地点": "辉针城" },

]

// Init Conversion

interface PlaceData {
    PlaceName: string[];
    Dish: string[];
    Guest: string[];
}

interface Ingredients {
    PositiveCharacteristics: string[],
    NegativeCharacteristics: string[]
}

interface Dish {
    "Name": string,
    "Kitchenware": string,
    "Ingredients": string[],
    "Price": number,
    "Grade": number,
    "Time": number,
    "AcquisitionMethod": string
}

// Start Conversion
var dic: PlaceData = {
    PlaceName: [],
    Dish: [],
    Guest: [],
};

料理.forEach(dish => {
    dic.Dish.push(dish.名称)
})
dic.Dish = Array.from(new Set(dic.Dish))

稀客.forEach(guest => {
    guest["出没地点（非邀请状态下三级店）"].split("、").forEach(s => {
        dic.PlaceName.push(s)
    })
    dic.Guest.push(guest.名称)
})
普客.forEach(guest => {
    guest.出没地点.split("、").forEach(s => {
        dic.PlaceName.push(s)
    })
    dic.Guest.push(guest.名称)
})
dic.PlaceName = Array.from(new Set(dic.PlaceName))
dic.Guest = Array.from(new Set(dic.Guest))

export function DIC() {
    return dic
};

interface PersonInfo {
    money: string,
    frequent_occurrence: string[],
    like: string[],
    unlike: string[],
    likewine: string[]
}

var ingredients = new Map<string, Ingredients>();

var personInfo = new Map<string, PersonInfo>();

dic.Guest.forEach(guest => {
    稀客.filter(xk => xk.名称 == guest).forEach(k => {
        personInfo.set(guest, {
            money: k.携带金额,
            frequent_occurrence: k["出没地点（非邀请状态下三级店）"].split("、"),
            like: k["喜好·料理"].split("、"),
            unlike: k["厌恶·料理"].split("、"),
            likewine: k["喜好·酒水"].split("、")
        })
    })
    普客.filter(pk => pk.名称 == guest).forEach(k => {
        personInfo.set(guest, {
            money: "",
            frequent_occurrence: k.出没地点.split("、"),
            like: k["喜好·料理"].split("、"),
            unlike: [],
            likewine: k["喜好·酒水"].split("、")
        })
    })
})

export function PERSON_INFO() {
    return personInfo
};

interface RESPONS_PLACE {
    出现的人物: string[],
    推荐菜单: string[],
    推荐酒水: string[],
    推荐能获得的物品: string[],
    推荐能完成的任务: string[],
    推荐成就: string[]
}

interface RESPONS_GUEST {
    人物属性: PersonInfo,
    人物技能: string[],
    推荐菜单: string[],
    推荐酒水: string[]
}

export function PLACE_INFO(local: string) {
    var rp: RESPONS_PLACE = {
        出现的人物: [],//
        推荐菜单: [],//
        推荐酒水: [],//
        推荐能获得的物品: [],// TODO
        推荐能完成的任务: [],// TODO
        推荐成就: []// TODO
    }
    稀客.filter(xk => xk["出没地点（非邀请状态下三级店）"].includes(local)).forEach(k => {
        rp.出现的人物.push(k.名称)
        k["喜好·料理"].split("、").forEach(i => rp.推荐菜单.push(i))
        k["喜好·酒水"].split("、").forEach(i => rp.推荐酒水.push(i))
        rp.推荐菜单 = Array.from(new Set(rp.推荐菜单))
        rp.推荐酒水 = Array.from(new Set(rp.推荐酒水))
    })
    普客.filter(pk => pk.出没地点 .includes(local) ).forEach(k => {
        rp.出现的人物.push(k.名称)
        k["喜好·料理"].split("、").forEach(i => rp.推荐菜单.push(i))
        k["喜好·酒水"].split("、").forEach(i => rp.推荐酒水.push(i))
        rp.推荐菜单 = Array.from(new Set(rp.推荐菜单))
        rp.推荐酒水 = Array.from(new Set(rp.推荐酒水))
    })

    return rp
};

export function GUEST_INFO(name: string) {
    var rg: RESPONS_GUEST = {
        人物属性: personInfo.get(name)!,
        人物技能: [],// TODO
        推荐菜单: [],//
        推荐酒水: []//
    }
    稀客.filter(xk => xk.名称 == name).forEach(k => {
        k["喜好·料理"].split("、").forEach(i => {
            料理.filter(e=>e.正特性.includes(i)).forEach(i=>rg.推荐菜单.push(i.名称))
        })
        k["喜好·酒水"].split("、").forEach(i => {
            酒水.filter(e=>e.特性.includes(i)).forEach(i=>rg.推荐酒水.push(i.名称))
        })
        rg.推荐菜单 = Array.from(new Set(rg.推荐菜单))
        rg.推荐酒水 = Array.from(new Set(rg.推荐酒水))
    })
    普客.filter(pk => pk.名称 == name).forEach(k => {
        k["喜好·料理"].split("、").forEach(i => {
            料理.filter(e=>e.正特性.includes(i)).forEach(i=>rg.推荐菜单.push(i.名称))
        })
        k["喜好·酒水"].split("、").forEach(i => {
            酒水.filter(e=>e.特性.includes(i)).forEach(i=>rg.推荐酒水.push(i.名称))
        })
        rg.推荐菜单 = Array.from(new Set(rg.推荐菜单))
        rg.推荐酒水 = Array.from(new Set(rg.推荐酒水))
    })
    return rg
};
